const stockData = [
  {
    "id": "1101",
    "code": "1101",
    "name": "台泥",
    "buyDate": "03-19買",
    "s2026": "折疊環保提包",
    "s2025": "多功能雙色蓋毯"
  },
  {
    "id": "1103",
    "code": "1103",
    "name": "嘉泥",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "GiveU 尼龍收納三用包"
  },
  {
    "id": "1201",
    "code": "1201",
    "name": "味全",
    "buyDate": "",
    "s2026": "",
    "s2025": "料理高手-蔬果本味調味料"
  },
  {
    "id": "1203",
    "code": "1203",
    "name": "味王",
    "buyDate": "",
    "s2026": "",
    "s2025": "咖哩雞肉(2入組)一盒"
  },
  {
    "id": "1210",
    "code": "1210",
    "name": "大成",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "安心購折150券 ~ 2026-06-30"
  },
  {
    "id": "1215",
    "code": "1215",
    "name": "卜蜂",
    "buyDate": "03-25買",
    "s2026": "雞肉鬆乙包",
    "s2025": "雞肉鬆乙包"
  },
  {
    "id": "1217",
    "code": "1217",
    "name": "愛之味",
    "buyDate": "",
    "s2026": "",
    "s2025": "愛之味咖哩豆腐2罐"
  },
  {
    "id": "1219",
    "code": "1219",
    "name": "福壽",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "福壽香油"
  },
  {
    "id": "1220",
    "code": "1220",
    "name": "台榮",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "無患子洗手乳"
  },
  {
    "id": "1225",
    "code": "1225",
    "name": "福懋油",
    "buyDate": "03-13買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $100"
  },
  {
    "id": "1225",
    "code": "1225",
    "name": "福懋油",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $100"
  },
  {
    "id": "1233",
    "code": "1233",
    "name": "天仁",
    "buyDate": "04-08買",
    "s2026": "無",
    "s2025": "App 優惠券, 50元紙本折價券等 (限2股以上,股利通知)"
  },
  {
    "id": "1305",
    "code": "1305",
    "name": "華夏",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "USii優系高效鎖鮮袋"
  },
  {
    "id": "1308",
    "code": "1308",
    "name": "亞聚",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "USii優系高效鎖鮮袋"
  },
  {
    "id": "1309",
    "code": "1309",
    "name": "台達化",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "USii優系高效鎖鮮袋"
  },
  {
    "id": "1310",
    "code": "1310",
    "name": "台苯",
    "buyDate": "03-24買",
    "s2026": "常健順暢益生菌",
    "s2025": "常健順暢益生菌"
  },
  {
    "id": "1312",
    "code": "1312",
    "name": "國喬",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "掌廚可樂膳304不鏽鋼分隔防燙保鮮盒"
  },
  {
    "id": "1314",
    "code": "1314",
    "name": "中石化",
    "buyDate": "03-19買",
    "s2026": "統一超商 $100 商品卡",
    "s2025": "7-11 $100 禮券"
  },
  {
    "id": "1316",
    "code": "1316",
    "name": "上曜",
    "buyDate": "",
    "s2026": "",
    "s2025": "朝和生醫保健食品一包 ; 【朝和生醫】愛視泌EX金盞草外泌體複方膠囊(全素)乙包"
  },
  {
    "id": "1325",
    "code": "1325",
    "name": "恆大",
    "buyDate": "04-23買",
    "s2026": "未定",
    "s2025": "口罩壹盒"
  },
  {
    "id": "1337",
    "code": "1337",
    "name": "再生-KY",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "居慕洗手液"
  },
  {
    "id": "1338",
    "code": "1338",
    "name": "廣華-KY",
    "buyDate": "03-19買",
    "s2026": "統一超商商品卡 $50",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1340",
    "code": "1340",
    "name": "勝悅-KY",
    "buyDate": "04-07買",
    "s2026": "超商券50",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "1409",
    "code": "1409",
    "name": "新纖",
    "buyDate": "03-25買",
    "s2026": "保溫保冷袋",
    "s2025": "紳士襪"
  },
  {
    "id": "1414",
    "code": "1414",
    "name": "東和",
    "buyDate": "04-14買",
    "s2026": "未定",
    "s2025": "圍巾"
  },
  {
    "id": "1416",
    "code": "1416",
    "name": "廣豐",
    "buyDate": "03-19買",
    "s2026": "毛巾",
    "s2025": "毛巾"
  },
  {
    "id": "1417",
    "code": "1417",
    "name": "嘉裕",
    "buyDate": "03-19買",
    "s2026": "機能襪",
    "s2025": "機能襪"
  },
  {
    "id": "1418",
    "code": "1418",
    "name": "東華",
    "buyDate": "",
    "s2026": "",
    "s2025": "EVA雨衣"
  },
  {
    "id": "1432",
    "code": "1432",
    "name": "大魯閣",
    "buyDate": "03-25買",
    "s2026": "『800元消費抵用券』、『每月玩樂買1送1券』8張",
    "s2025": "『800元消費抵用券』、『每月玩樂買1送1券』8張"
  },
  {
    "id": "1440",
    "code": "1440",
    "name": "南紡",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "統一好勁道麵條5入組"
  },
  {
    "id": "1449",
    "code": "1449",
    "name": "佳和",
    "buyDate": "",
    "s2026": "",
    "s2025": "佳和4D立體醫用口罩(未滅菌)"
  },
  {
    "id": "1452",
    "code": "1452",
    "name": "宏益",
    "buyDate": "04-09買",
    "s2026": "濕紙巾",
    "s2025": "高露潔旅行組"
  },
  {
    "id": "1463",
    "code": "1463",
    "name": "強盛新",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1471",
    "code": "1471",
    "name": "首利",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "1513",
    "code": "1513",
    "name": "中興電",
    "buyDate": "03-24買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "小羊苗聯名款真空隨行杯"
  },
  {
    "id": "1514",
    "code": "1514",
    "name": "亞力",
    "buyDate": "",
    "s2026": "",
    "s2025": "珪藻土桌墊"
  },
  {
    "id": "1516",
    "code": "1516",
    "name": "川飛",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "1517",
    "code": "1517",
    "name": "利奇",
    "buyDate": "",
    "s2026": "",
    "s2025": "多功能手機支架"
  },
  {
    "id": "1524",
    "code": "1524",
    "name": "耿鼎",
    "buyDate": "04-15買",
    "s2026": "菜瓜布",
    "s2025": "菜瓜布"
  },
  {
    "id": "1526",
    "code": "1526",
    "name": "日馳",
    "buyDate": "04-22買",
    "s2026": "中杯熱美式咖啡券",
    "s2025": "全家中杯美式咖啡券 ~ 2028-06-30"
  },
  {
    "id": "1527",
    "code": "1527",
    "name": "鑽全",
    "buyDate": "04-14買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "1528",
    "code": "1528",
    "name": "恩德",
    "buyDate": "03-19買",
    "s2026": "7-11 $50 商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1536",
    "code": "1536",
    "name": "和大",
    "buyDate": "03-26買",
    "s2026": "超商 $50 商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1540",
    "code": "1540",
    "name": "喬福",
    "buyDate": "04-28買",
    "s2026": "伊莎貝爾櫻花抗菌皂 重量：75g +13g 產地：印尼",
    "s2025": "伊莎貝爾櫻花抗菌皂75G+-3G"
  },
  {
    "id": "1563",
    "code": "1563",
    "name": "巧新",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "1565",
    "code": "1565",
    "name": "精華",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "醫之方晶采金盞花葉黃素 30錠"
  },
  {
    "id": "1569",
    "code": "1569",
    "name": "濱川",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 商品卡 $35"
  },
  {
    "id": "1570",
    "code": "1570",
    "name": "力肯",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1580",
    "code": "1580",
    "name": "新麥",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "7-11咖啡兌換券"
  },
  {
    "id": "1582",
    "code": "1582",
    "name": "信錦",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "7-11 $100 禮券"
  },
  {
    "id": "1584",
    "code": "1584",
    "name": "精剛",
    "buyDate": "03-25買",
    "s2026": "順暢益生菌",
    "s2025": "常健順暢益生菌"
  },
  {
    "id": "1589",
    "code": "1589",
    "name": "永冠-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "1591",
    "code": "1591",
    "name": "駿吉-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "1604",
    "code": "1604",
    "name": "聲寶",
    "buyDate": "04-15買",
    "s2026": "雨傘",
    "s2025": "雨傘"
  },
  {
    "id": "1605",
    "code": "1605",
    "name": "華新",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "永續益田米(白米/每包1,000公克)"
  },
  {
    "id": "1609",
    "code": "1609",
    "name": "大亞",
    "buyDate": "03-19買",
    "s2026": "7-11商品卡 $35",
    "s2025": "7-11商品卡 $35"
  },
  {
    "id": "1611",
    "code": "1611",
    "name": "中電",
    "buyDate": "03-25買",
    "s2026": "$50 超商禮物卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1707",
    "code": "1707",
    "name": "葡萄王",
    "buyDate": "03-25買",
    "s2026": "葡萄王動能膠囊30粒/瓶",
    "s2025": "葡萄王靈芝巴西菇菌絲體益菌複方膠囊50粒/瓶"
  },
  {
    "id": "1708",
    "code": "1708",
    "name": "東鹼",
    "buyDate": "03-18買",
    "s2026": "小蘇打粉",
    "s2025": "東南實業公司小蘇打粉"
  },
  {
    "id": "1709",
    "code": "1709",
    "name": "和益",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "德菲雅掛耳式咖啡"
  },
  {
    "id": "1711",
    "code": "1711",
    "name": "永光",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "慕斯洗手乳"
  },
  {
    "id": "1712",
    "code": "1712",
    "name": "興農",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "『一滴淨液態洗衣槽清潔劑一瓶』"
  },
  {
    "id": "1714",
    "code": "1714",
    "name": "和桐",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50 乙張"
  },
  {
    "id": "1718",
    "code": "1718",
    "name": "中纖",
    "buyDate": "04-08買",
    "s2026": "燕窩飲一份",
    "s2025": "機能性食品一份"
  },
  {
    "id": "1721",
    "code": "1721",
    "name": "三晃",
    "buyDate": "04-15買",
    "s2026": "商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "1722",
    "code": "1722",
    "name": "台肥",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "胺基酸深層潔顏慕斯+玻尿酸保濕潤澤化妝水禮盒"
  },
  {
    "id": "1723",
    "code": "1723",
    "name": "中碳",
    "buyDate": "03-25買",
    "s2026": "7-11 商品卡 $50",
    "s2025": "康寧耐熱玻璃烤盤"
  },
  {
    "id": "1733",
    "code": "1733",
    "name": "五鼎",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "保鮮盒"
  },
  {
    "id": "1734",
    "code": "1734",
    "name": "杏輝",
    "buyDate": "",
    "s2026": "",
    "s2025": "茯苓善補B群膠囊20粒/瓶"
  },
  {
    "id": "1762",
    "code": "1762",
    "name": "中化生",
    "buyDate": "03-25買",
    "s2026": "綠的抗菌潔手慕斯",
    "s2025": "綠的抗菌旅行組合"
  },
  {
    "id": "1781",
    "code": "1781",
    "name": "合世",
    "buyDate": "",
    "s2026": "",
    "s2025": "伊莎貝爾櫻花沐浴皂"
  },
  {
    "id": "1783",
    "code": "1783",
    "name": "和康生",
    "buyDate": "",
    "s2026": "",
    "s2025": "至尊膠原面膜限量盲盒"
  },
  {
    "id": "1784",
    "code": "1784",
    "name": "訊聯",
    "buyDate": "04-09買",
    "s2026": "外泌體極萃彈潤舒護面膜",
    "s2025": "Meta Exosome外泌體水光潤澤修護面膜"
  },
  {
    "id": "1785",
    "code": "1785",
    "name": "光洋科",
    "buyDate": "03-24買",
    "s2026": "伊甸小羊苗質樸暖心舒活皂",
    "s2025": "沙威隆抗菌組"
  },
  {
    "id": "1786",
    "code": "1786",
    "name": "科妍",
    "buyDate": "04-28買",
    "s2026": "未定",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "1809",
    "code": "1809",
    "name": "中釉",
    "buyDate": "04-22買",
    "s2026": "氣墊襪(顏色混搭，Free Size )",
    "s2025": "高露潔旅行組"
  },
  {
    "id": "1815",
    "code": "1815",
    "name": "富喬",
    "buyDate": "",
    "s2026": "",
    "s2025": "不鏽鋼玻璃調味罐"
  },
  {
    "id": "1904",
    "code": "1904",
    "name": "正隆",
    "buyDate": "03-26買",
    "s2026": "春風官方購物商城AeSHOP折價券$200",
    "s2025": "春風抽取式衛生紙一串"
  },
  {
    "id": "1909",
    "code": "1909",
    "name": "榮成",
    "buyDate": "03-25買",
    "s2026": "環保袋",
    "s2025": "環保杯"
  },
  {
    "id": "2002",
    "code": "2002",
    "name": "中鋼",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "輕巧冷水瓶"
  },
  {
    "id": "2012",
    "code": "2012",
    "name": "春雨",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "甲魚全沛全方位維他命"
  },
  {
    "id": "2014",
    "code": "2014",
    "name": "中鴻",
    "buyDate": "03-19買",
    "s2026": "統一超商45元咖啡卡",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "2020",
    "code": "2020",
    "name": "美亞",
    "buyDate": "04-15買",
    "s2026": "無",
    "s2025": "全家便利商店 $50 禮物卡"
  },
  {
    "id": "2022",
    "code": "2022",
    "name": "聚亨",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "保溫保冷袋"
  },
  {
    "id": "2023",
    "code": "2023",
    "name": "燁輝",
    "buyDate": "04-22買",
    "s2026": "無",
    "s2025": "#304不銹鋼野營杯四入組"
  },
  {
    "id": "2024",
    "code": "2024",
    "name": "志聯",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "2030",
    "code": "2030",
    "name": "彰源",
    "buyDate": "03-25買",
    "s2026": "運動休閒毛巾襪",
    "s2025": "運動休閒毛巾襪"
  },
  {
    "id": "2031",
    "code": "2031",
    "name": "新光鋼",
    "buyDate": "03-24買",
    "s2026": "妙管家小蘇打抗菌洗衣精600g一份",
    "s2025": "毛寶好無比室內晾曬洗衣精(500g)"
  },
  {
    "id": "2065",
    "code": "2065",
    "name": "世豐",
    "buyDate": "03-31買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "2102",
    "code": "2102",
    "name": "泰豐",
    "buyDate": "03-18買",
    "s2026": "超商商品卡( $50 )",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "2104",
    "code": "2104",
    "name": "國際中橡",
    "buyDate": "03-25買",
    "s2026": "折疊環保提包",
    "s2025": "多功能雙色蓋毯"
  },
  {
    "id": "2107",
    "code": "2107",
    "name": "厚生",
    "buyDate": "",
    "s2026": "",
    "s2025": "手提袋"
  },
  {
    "id": "2108",
    "code": "2108",
    "name": "南帝",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "珍珍休閒食品"
  },
  {
    "id": "2206",
    "code": "2206",
    "name": "三陽工業",
    "buyDate": "",
    "s2026": "",
    "s2025": "餐具套組"
  },
  {
    "id": "2208",
    "code": "2208",
    "name": "台船",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商45元咖啡卡"
  },
  {
    "id": "2233",
    "code": "2233",
    "name": "宇隆",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "松村窯日式簡約5碗"
  },
  {
    "id": "2241",
    "code": "2241",
    "name": "艾姆勒",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "2312",
    "code": "2312",
    "name": "金寶",
    "buyDate": "03-24買",
    "s2026": "再生布卡夾",
    "s2025": "杜邦提袋"
  },
  {
    "id": "2313",
    "code": "2313",
    "name": "華通",
    "buyDate": "03-25買",
    "s2026": "南僑清潔用品",
    "s2025": "南僑清潔用品"
  },
  {
    "id": "2314",
    "code": "2314",
    "name": "台揚",
    "buyDate": "",
    "s2026": "",
    "s2025": "伊莎貝爾無患子洗手乳 ; 蜂王草本皂二入"
  },
  {
    "id": "2316",
    "code": "2316",
    "name": "楠梓電",
    "buyDate": "",
    "s2026": "",
    "s2025": "餐具組合"
  },
  {
    "id": "2323",
    "code": "2323",
    "name": "中環",
    "buyDate": "",
    "s2026": "",
    "s2025": "水晶肥皂洗衣精"
  },
  {
    "id": "2327",
    "code": "2327",
    "name": "國巨*",
    "buyDate": "03-25買",
    "s2026": "妙管家八倍濃縮洗衣球",
    "s2025": "妙管家八倍濃縮洗衣球"
  },
  {
    "id": "2328",
    "code": "2328",
    "name": "廣宇",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $35 ; 記名鴻海集團股東福利 (開會通知)"
  },
  {
    "id": "2329",
    "code": "2329",
    "name": "華泰",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "戶外用摺疊手柄不銹鋼杯"
  },
  {
    "id": "2332",
    "code": "2332",
    "name": "友訊",
    "buyDate": "03-24買",
    "s2026": "常健順暢益生菌",
    "s2025": "常健順暢益生菌"
  },
  {
    "id": "2338",
    "code": "2338",
    "name": "光罩",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "2340",
    "code": "2340",
    "name": "台亞",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "2342",
    "code": "2342",
    "name": "茂矽",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "清潔用品"
  },
  {
    "id": "2345",
    "code": "2345",
    "name": "智邦",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一商品卡 $50"
  },
  {
    "id": "2349",
    "code": "2349",
    "name": "錸德",
    "buyDate": "04-15買",
    "s2026": "洗衣機槽清潔錠",
    "s2025": "除黴凝膠"
  },
  {
    "id": "2352",
    "code": "2352",
    "name": "佳世達",
    "buyDate": "03-26買",
    "s2026": "史努比陶瓷雙碗組",
    "s2025": "乖乖發財巾88抽"
  },
  {
    "id": "2353",
    "code": "2353",
    "name": "宏碁",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "旋轉手機支架"
  },
  {
    "id": "2355",
    "code": "2355",
    "name": "敬鵬",
    "buyDate": "",
    "s2026": "",
    "s2025": "保溫保冷袋"
  },
  {
    "id": "2359",
    "code": "2359",
    "name": "所羅門",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "無患子洗手乳"
  },
  {
    "id": "2363",
    "code": "2363",
    "name": "矽統",
    "buyDate": "03-25買",
    "s2026": "工具組",
    "s2025": "陶瓷碗"
  },
  {
    "id": "2364",
    "code": "2364",
    "name": "倫飛",
    "buyDate": "04-09買",
    "s2026": "便利商店 $50 商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "2365",
    "code": "2365",
    "name": "昆盈",
    "buyDate": "04-15買",
    "s2026": "頭戴式耳機",
    "s2025": "全罩頭戴式耳機"
  },
  {
    "id": "2367",
    "code": "2367",
    "name": "燿華",
    "buyDate": "04-15買",
    "s2026": "感應小夜燈",
    "s2025": "多功能運動腰包"
  },
  {
    "id": "2369",
    "code": "2369",
    "name": "菱生",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "2371",
    "code": "2371",
    "name": "大同",
    "buyDate": "03-25買",
    "s2026": "Luminarc純白強化餐具2件套",
    "s2025": "統一超商商品卡 $100"
  },
  {
    "id": "2374",
    "code": "2374",
    "name": "佳能",
    "buyDate": "",
    "s2026": "",
    "s2025": "稻回皂-糠碳美容皂"
  },
  {
    "id": "2375",
    "code": "2375",
    "name": "凱美",
    "buyDate": "03-24買",
    "s2026": "妙管家煥彩香氛洗衣球",
    "s2025": "妙管家煥彩香氛洗衣球"
  },
  {
    "id": "2379",
    "code": "2379",
    "name": "瑞昱",
    "buyDate": "03-25買",
    "s2026": "全家便利商店88元禮物卡",
    "s2025": "全家便利商店88元禮物卡"
  },
  {
    "id": "2380",
    "code": "2380",
    "name": "虹光",
    "buyDate": "",
    "s2026": "",
    "s2025": "環保購物袋"
  },
  {
    "id": "2390",
    "code": "2390",
    "name": "云辰",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "2399",
    "code": "2399",
    "name": "映泰",
    "buyDate": "",
    "s2026": "",
    "s2025": "南僑水晶肥皂食器洗滌液体"
  },
  {
    "id": "2401",
    "code": "2401",
    "name": "凌陽",
    "buyDate": "04-14買",
    "s2026": "統一超商商品卡 $50",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "2402",
    "code": "2402",
    "name": "毅嘉",
    "buyDate": "04-15買",
    "s2026": "超商咖啡卡",
    "s2025": "超商咖啡提貨卡"
  },
  {
    "id": "2405",
    "code": "2405",
    "name": "輔信",
    "buyDate": "03-31買",
    "s2026": "康寧Amber 9吋湯盤",
    "s2025": "康寧Amber 7.5吋湯盤"
  },
  {
    "id": "2406",
    "code": "2406",
    "name": "國碩",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "2409",
    "code": "2409",
    "name": "友達",
    "buyDate": "03-25買",
    "s2026": "台灣產製真空包裝白米600公克",
    "s2025": "台灣產製真空包裝白米600公克"
  },
  {
    "id": "2417",
    "code": "2417",
    "name": "圓剛",
    "buyDate": "04-08買",
    "s2026": "不鏽鋼保溫杯",
    "s2025": "不鏽鋼杯"
  },
  {
    "id": "2420",
    "code": "2420",
    "name": "新巨",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "伊莎貝爾櫻花香皂二入"
  },
  {
    "id": "2425",
    "code": "2425",
    "name": "承啟",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "2426",
    "code": "2426",
    "name": "鼎元",
    "buyDate": "03-19買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "2429",
    "code": "2429",
    "name": "銘旺科",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "2431",
    "code": "2431",
    "name": "聯昌",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "樂雅樂兌換券 ~ 2026-03-31"
  },
  {
    "id": "2436",
    "code": "2436",
    "name": "偉詮電",
    "buyDate": "03-26買",
    "s2026": "香皂禮盒(二入)",
    "s2025": "洗潔精一瓶"
  },
  {
    "id": "2438",
    "code": "2438",
    "name": "翔耀",
    "buyDate": "04-07買",
    "s2026": "未定",
    "s2025": "經典抗菌皂"
  },
  {
    "id": "2442",
    "code": "2442",
    "name": "新美齊",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "毛寶洗衣精500ml"
  },
  {
    "id": "2444",
    "code": "2444",
    "name": "兆勁",
    "buyDate": "03-18買",
    "s2026": "防疫消毒酒精瓶",
    "s2025": "防疫消毒酒精瓶"
  },
  {
    "id": "2453",
    "code": "2453",
    "name": "凌群",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "折疊手提購物袋"
  },
  {
    "id": "2457",
    "code": "2457",
    "name": "飛宏",
    "buyDate": "04-08買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "2460",
    "code": "2460",
    "name": "建通",
    "buyDate": "",
    "s2026": "",
    "s2025": "雙口認證快充充電頭"
  },
  {
    "id": "2461",
    "code": "2461",
    "name": "光群雷",
    "buyDate": "03-24買",
    "s2026": "陶瓷碗組",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "2464",
    "code": "2464",
    "name": "盟立",
    "buyDate": "03-25買",
    "s2026": "義美提領券 $50",
    "s2025": "義美 $50 禮券 ~ 2027-06-30"
  },
  {
    "id": "2465",
    "code": "2465",
    "name": "麗臺",
    "buyDate": "03-31買",
    "s2026": "深海原萃極效修護面膜(一入)",
    "s2025": "BtNPN植物奈米貼片(二入)"
  },
  {
    "id": "2467",
    "code": "2467",
    "name": "志聖",
    "buyDate": "03-19買",
    "s2026": "磁吸可掛式開瓶器露營燈(USB充電)",
    "s2025": "可折疊矽膠咖啡杯"
  },
  {
    "id": "2471",
    "code": "2471",
    "name": "資通",
    "buyDate": "",
    "s2026": "",
    "s2025": "南僑水晶肥皂90克二入"
  },
  {
    "id": "2478",
    "code": "2478",
    "name": "大毅",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "2480",
    "code": "2480",
    "name": "敦陽科",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "統一超商商品卡， $35"
  },
  {
    "id": "2481",
    "code": "2481",
    "name": "強茂",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "毛寶好無比洗衣精"
  },
  {
    "id": "2482",
    "code": "2482",
    "name": "連宇",
    "buyDate": "03-25買",
    "s2026": "沙威隆經典抗菌皂二入",
    "s2025": "沙威隆經典抗菌皂二入"
  },
  {
    "id": "2484",
    "code": "2484",
    "name": "希華",
    "buyDate": "",
    "s2026": "",
    "s2025": "米"
  },
  {
    "id": "2485",
    "code": "2485",
    "name": "兆赫",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商60元商品卡"
  },
  {
    "id": "2486",
    "code": "2486",
    "name": "一詮",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "全家大杯美式咖啡券 ~ 2028-12-31"
  },
  {
    "id": "2488",
    "code": "2488",
    "name": "漢平",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $35"
  },
  {
    "id": "2489",
    "code": "2489",
    "name": "瑞軒",
    "buyDate": "03-25買",
    "s2026": "真空壓縮收納袋組(附抽氣沯)",
    "s2025": "充電式磁吸感應燈"
  },
  {
    "id": "2493",
    "code": "2493",
    "name": "揚博",
    "buyDate": "",
    "s2026": "",
    "s2025": "蔬果刨刀二入組"
  },
  {
    "id": "2498",
    "code": "2498",
    "name": "宏達電",
    "buyDate": "",
    "s2026": "",
    "s2025": "HTC多彩環保對杯"
  },
  {
    "id": "2504",
    "code": "2504",
    "name": "國產",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "超輕量冰壩杯"
  },
  {
    "id": "2506",
    "code": "2506",
    "name": "太設",
    "buyDate": "",
    "s2026": "",
    "s2025": "輕飲御口保溫瓶"
  },
  {
    "id": "2515",
    "code": "2515",
    "name": "中工",
    "buyDate": "03-18買",
    "s2026": "未定→不發",
    "s2025": "陶瓷隨行杯"
  },
  {
    "id": "2516",
    "code": "2516",
    "name": "新建",
    "buyDate": "",
    "s2026": "",
    "s2025": "保溫袋(含折疊矽膠盒)"
  },
  {
    "id": "2520",
    "code": "2520",
    "name": "冠德",
    "buyDate": "03-25買",
    "s2026": "環球購物中心禮券 $100",
    "s2025": "環球購物中心禮券 $100"
  },
  {
    "id": "2534",
    "code": "2534",
    "name": "宏盛",
    "buyDate": "03-25買",
    "s2026": "白米1公斤^",
    "s2025": "白米"
  },
  {
    "id": "2535",
    "code": "2535",
    "name": "達欣工",
    "buyDate": "04-08買",
    "s2026": "BLACK HAMMER耐熱玻璃法式濾壓壺",
    "s2025": "NAKAMURA日式陶瓷四入碗"
  },
  {
    "id": "2537",
    "code": "2537",
    "name": "聯上發",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "毛寶洗衣精"
  },
  {
    "id": "2546",
    "code": "2546",
    "name": "根基",
    "buyDate": "03-24買",
    "s2026": "環球購物中心禮券 $100",
    "s2025": "環球購物中心禮券 $100"
  },
  {
    "id": "2547",
    "code": "2547",
    "name": "日勝生",
    "buyDate": "04-08買",
    "s2026": "無",
    "s2025": "美容刷"
  },
  {
    "id": "2601",
    "code": "2601",
    "name": "益航",
    "buyDate": "",
    "s2026": "",
    "s2025": "妙管家手提玻璃晶靓杯"
  },
  {
    "id": "2605",
    "code": "2605",
    "name": "新興",
    "buyDate": "",
    "s2026": "",
    "s2025": "苦茶油香皂禮盒"
  },
  {
    "id": "2608",
    "code": "2608",
    "name": "嘉里大榮",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "隨身碟"
  },
  {
    "id": "2611",
    "code": "2611",
    "name": "志信",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "7-11 商品卡 $35"
  },
  {
    "id": "2612",
    "code": "2612",
    "name": "中航",
    "buyDate": "03-26買",
    "s2026": "無",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "2613",
    "code": "2613",
    "name": "中櫃",
    "buyDate": "03-18買",
    "s2026": "無",
    "s2025": "小熊保溫保冷袋"
  },
  {
    "id": "2614",
    "code": "2614",
    "name": "東森",
    "buyDate": "03-18買",
    "s2026": "森美妍白茶賦活保濕素顏霜",
    "s2025": "森美妍胺基酸保濕潔面霜"
  },
  {
    "id": "2616",
    "code": "2616",
    "name": "山隆",
    "buyDate": "",
    "s2026": "",
    "s2025": "春風抽取式衛生紙一串"
  },
  {
    "id": "2636",
    "code": "2636",
    "name": "台驊控股",
    "buyDate": "03-31買",
    "s2026": "台灣茶摳滋養沐浴皂",
    "s2025": "炭錢黃金皂二入"
  },
  {
    "id": "2641",
    "code": "2641",
    "name": "正德",
    "buyDate": "03-25買",
    "s2026": "7-11 $35 商品卡",
    "s2025": "7-11 $35 商品卡"
  },
  {
    "id": "2646",
    "code": "2646",
    "name": "星宇航空",
    "buyDate": "03-26買",
    "s2026": "無",
    "s2025": "機票折1500代碼 (限1000股以上,開會通知)"
  },
  {
    "id": "2727",
    "code": "2727",
    "name": "王品",
    "buyDate": "",
    "s2026": "",
    "s2025": "王品股東大禮包 ~ 2026-06-30"
  },
  {
    "id": "2731",
    "code": "2731",
    "name": "雄獅",
    "buyDate": "03-24買",
    "s2026": "國內外團體旅遊兌換券700元(國內團體200元及國外團體500元)",
    "s2025": "國內外團體旅遊兌換券700元(國內團體200元及國外團體500元)"
  },
  {
    "id": "2734",
    "code": "2734",
    "name": "易飛網",
    "buyDate": "",
    "s2026": "",
    "s2025": "高露潔旅行組"
  },
  {
    "id": "2834",
    "code": "2834",
    "name": "臺企銀",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡( $50 )"
  },
  {
    "id": "2880",
    "code": "2880",
    "name": "華南金",
    "buyDate": "",
    "s2026": "",
    "s2025": "LINE FRIENDS不鏽鋼杯+造型吊飾組"
  },
  {
    "id": "2883",
    "code": "2883",
    "name": "凱基金",
    "buyDate": "",
    "s2026": "",
    "s2025": "電動研磨器"
  },
  {
    "id": "2885",
    "code": "2885",
    "name": "元大金",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "全家 $100 禮券"
  },
  {
    "id": "2887",
    "code": "2887",
    "name": "台新新光金",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "精緻密封調味罐"
  },
  {
    "id": "2889",
    "code": "2889",
    "name": "國票金",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "2890",
    "code": "2890",
    "name": "永豐金",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "【金元包(便當盒+包)】) ; 全家便利商店禮物卡 $100"
  },
  {
    "id": "2891",
    "code": "2891",
    "name": "中信金",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "護眼愛地球可調光檯燈"
  },
  {
    "id": "2911",
    "code": "2911",
    "name": "麗嬰房",
    "buyDate": "03-31買",
    "s2026": "嬰兒柔護濕巾20抽/單包",
    "s2025": "嬰兒柔護濕巾20抽/單包"
  },
  {
    "id": "2913",
    "code": "2913",
    "name": "農林",
    "buyDate": "",
    "s2026": "",
    "s2025": "澄韻紅茶150g"
  },
  {
    "id": "2929",
    "code": "2929",
    "name": "淘帝-KY",
    "buyDate": "04-28買",
    "s2026": "未定",
    "s2025": "統一超商咖啡卡 $35"
  },
  {
    "id": "2947",
    "code": "2947",
    "name": "振宇五金",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "實體門市滿2百折1百券 (紙本開會通知)"
  },
  {
    "id": "3006",
    "code": "3006",
    "name": "晶豪科",
    "buyDate": "03-19買",
    "s2026": "鋼珠對筆",
    "s2025": "可折叠桌面手機支架"
  },
  {
    "id": "3010",
    "code": "3010",
    "name": "華立",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "3011",
    "code": "3011",
    "name": "今皓",
    "buyDate": "04-28買",
    "s2026": "未定",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "3014",
    "code": "3014",
    "name": "聯陽",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "香皂"
  },
  {
    "id": "3019",
    "code": "3019",
    "name": "亞光",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "圓型玻璃保鮮盒"
  },
  {
    "id": "3023",
    "code": "3023",
    "name": "信邦",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "多功能餐具組"
  },
  {
    "id": "3024",
    "code": "3024",
    "name": "憶聲",
    "buyDate": "03-11買",
    "s2026": "Lynx真空掀蓋隨行杯",
    "s2025": "小麥秸稈餐具組"
  },
  {
    "id": "3025",
    "code": "3025",
    "name": "星通",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品券 $50"
  },
  {
    "id": "3026",
    "code": "3026",
    "name": "禾伸堂",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "手機支架"
  },
  {
    "id": "3027",
    "code": "3027",
    "name": "盛達",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "公益砧板"
  },
  {
    "id": "3028",
    "code": "3028",
    "name": "增你強",
    "buyDate": "",
    "s2026": "",
    "s2025": "多功能鑰匙扣燈"
  },
  {
    "id": "3032",
    "code": "3032",
    "name": "偉訓",
    "buyDate": "",
    "s2026": "",
    "s2025": "菲蘇德美燕麥潔膚皂"
  },
  {
    "id": "3033",
    "code": "3033",
    "name": "威健",
    "buyDate": "04-15買",
    "s2026": "威健帆布提袋",
    "s2025": "伊莎貝爾櫻花沐浴皂"
  },
  {
    "id": "3034",
    "code": "3034",
    "name": "聯詠",
    "buyDate": "03-26買",
    "s2026": "超商商品卡 $50",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3035",
    "code": "3035",
    "name": "智原",
    "buyDate": "03-24買",
    "s2026": "便利商店商品卡 $50",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3038",
    "code": "3038",
    "name": "全台",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "玻璃碗"
  },
  {
    "id": "3041",
    "code": "3041",
    "name": "揚智",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡 ; Luminarc繁花強化餐盤"
  },
  {
    "id": "3043",
    "code": "3043",
    "name": "科風",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "3047",
    "code": "3047",
    "name": "訊舟",
    "buyDate": "04-15買",
    "s2026": "清新植萃精華皂二入盒",
    "s2025": "清新植感草本皂二入盒"
  },
  {
    "id": "3048",
    "code": "3048",
    "name": "益登",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "3049",
    "code": "3049",
    "name": "精金",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "STAND濾掛咖啡Maja聯名5入組"
  },
  {
    "id": "3049",
    "code": "3049",
    "name": "精金",
    "buyDate": "03-18買",
    "s2026": "未定→撤銷",
    "s2025": "STAND濾掛咖啡Maja聯名5入組"
  },
  {
    "id": "3050",
    "code": "3050",
    "name": "鈺德",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "除霉凝膠"
  },
  {
    "id": "3051",
    "code": "3051",
    "name": "力特",
    "buyDate": "04-22買",
    "s2026": "台灣製ESG公益砧板",
    "s2025": "精美料理剪刀"
  },
  {
    "id": "3052",
    "code": "3052",
    "name": "夆典",
    "buyDate": "04-08買",
    "s2026": "五合一工具組",
    "s2025": "黃麻手提環保袋"
  },
  {
    "id": "3056",
    "code": "3056",
    "name": "富華新",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "3057",
    "code": "3057",
    "name": "喬鼎",
    "buyDate": "",
    "s2026": "",
    "s2025": "24合一螺絲工具組"
  },
  {
    "id": "3058",
    "code": "3058",
    "name": "立德",
    "buyDate": "04-22買",
    "s2026": "手機支架",
    "s2025": "蜂王清新植感草本皂"
  },
  {
    "id": "3059",
    "code": "3059",
    "name": "華晶科",
    "buyDate": "",
    "s2026": "",
    "s2025": "方型玻璃沙拉碗"
  },
  {
    "id": "3060",
    "code": "3060",
    "name": "銘異",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "全家便利商店 $50 禮物卡"
  },
  {
    "id": "3062",
    "code": "3062",
    "name": "建漢",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "碗筷2件套禮盒"
  },
  {
    "id": "3078",
    "code": "3078",
    "name": "僑威",
    "buyDate": "",
    "s2026": "",
    "s2025": "450g毛寶洗碗精"
  },
  {
    "id": "3081",
    "code": "3081",
    "name": "聯亞",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "3090",
    "code": "3090",
    "name": "日電貿",
    "buyDate": "03-19買",
    "s2026": "無患子潔手慕斯",
    "s2025": "伊莎貝爾抗菌洗手乳香皂組"
  },
  {
    "id": "3092",
    "code": "3092",
    "name": "鴻碩",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "訊號線"
  },
  {
    "id": "3094",
    "code": "3094",
    "name": "聯傑",
    "buyDate": "03-25買",
    "s2026": "便利貼",
    "s2025": "保冷袋"
  },
  {
    "id": "3095",
    "code": "3095",
    "name": "及成",
    "buyDate": "",
    "s2026": "",
    "s2025": "不銹鋼餐具組"
  },
  {
    "id": "3115",
    "code": "3115",
    "name": "富榮綱",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家便利商店 $100 禮物卡"
  },
  {
    "id": "3118",
    "code": "3118",
    "name": "進階",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "全家便利店禮物卡 $35"
  },
  {
    "id": "3122",
    "code": "3122",
    "name": "笙泉",
    "buyDate": "03-05買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "3128",
    "code": "3128",
    "name": "昇銳",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "3131",
    "code": "3131",
    "name": "弘塑",
    "buyDate": "",
    "s2026": "",
    "s2025": "香皂"
  },
  {
    "id": "3138",
    "code": "3138",
    "name": "耀登",
    "buyDate": "",
    "s2026": "",
    "s2025": "手工串皂"
  },
  {
    "id": "3141",
    "code": "3141",
    "name": "晶宏",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "食器洗滌液"
  },
  {
    "id": "3149",
    "code": "3149",
    "name": "正達",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "潔膚皂"
  },
  {
    "id": "3176",
    "code": "3176",
    "name": "基亞",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "收納小包"
  },
  {
    "id": "3205",
    "code": "3205",
    "name": "佰研",
    "buyDate": "03-04買",
    "s2026": "無",
    "s2025": "Biotta百奧維他果汁 1瓶"
  },
  {
    "id": "3206",
    "code": "3206",
    "name": "志豐",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "木製精巧手機座"
  },
  {
    "id": "3209",
    "code": "3209",
    "name": "全科",
    "buyDate": "",
    "s2026": "",
    "s2025": "旅行收納袋"
  },
  {
    "id": "3211",
    "code": "3211",
    "name": "順達",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "3213",
    "code": "3213",
    "name": "茂訊",
    "buyDate": "04-08買",
    "s2026": "鍋寶萬用不沾刀具三件組",
    "s2025": "三入微波保鮮盒"
  },
  {
    "id": "3221",
    "code": "3221",
    "name": "台嘉碩",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "圓形多功能數據線收納盒"
  },
  {
    "id": "3227",
    "code": "3227",
    "name": "原相",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "【Luminarc 20cm晶鑽浮雕白玉深盤】"
  },
  {
    "id": "3230",
    "code": "3230",
    "name": "錦明",
    "buyDate": "",
    "s2026": "",
    "s2025": "錦明股東專屬會員卡"
  },
  {
    "id": "3236",
    "code": "3236",
    "name": "千如",
    "buyDate": "04-08買",
    "s2026": "運動涼感巾",
    "s2025": "木質手機支架"
  },
  {
    "id": "3260",
    "code": "3260",
    "name": "威剛",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "7-11 $50 商品卡"
  },
  {
    "id": "3268",
    "code": "3268",
    "name": "海德威",
    "buyDate": "",
    "s2026": "",
    "s2025": "宜睿 $35 禮券 (A版)"
  },
  {
    "id": "3276",
    "code": "3276",
    "name": "宇環",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3289",
    "code": "3289",
    "name": "宜特",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3290",
    "code": "3290",
    "name": "東浦",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "全家禮品提領卡(經典美式中杯1杯)"
  },
  {
    "id": "3305",
    "code": "3305",
    "name": "昇貿",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $35"
  },
  {
    "id": "3306",
    "code": "3306",
    "name": "鼎天",
    "buyDate": "04-07買",
    "s2026": "未定",
    "s2025": "Give U指甲剪刨光套組"
  },
  {
    "id": "3312",
    "code": "3312",
    "name": "弘憶股",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "3317",
    "code": "3317",
    "name": "尼克森",
    "buyDate": "04-08買",
    "s2026": "好來輕便組(好來超氟強化琺瑯質牙膏50g+好來經典纖柔軟毛牙刷乙支))",
    "s2025": "高露潔輕便組(高露潔全效牙膏20g＋高露潔潔淨護齦牙刷乙支))"
  },
  {
    "id": "3321",
    "code": "3321",
    "name": "同泰",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "3321",
    "code": "3321",
    "name": "同泰",
    "buyDate": "01-07買",
    "s2026": "全家 $50 禮券^",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "3322",
    "code": "3322",
    "name": "建舜電",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "3323",
    "code": "3323",
    "name": "加百裕",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $100 禮券 ; 黃麻環保購物袋"
  },
  {
    "id": "3324",
    "code": "3324",
    "name": "雙鴻",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "全家禮物卡 ( $50 )"
  },
  {
    "id": "3325",
    "code": "3325",
    "name": "旭品",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡一張"
  },
  {
    "id": "3338",
    "code": "3338",
    "name": "泰碩",
    "buyDate": "03-25買",
    "s2026": "全家便利商店禮物卡 $50",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "3339",
    "code": "3339",
    "name": "泰谷",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "7-11 $35 美式咖啡卡"
  },
  {
    "id": "3346",
    "code": "3346",
    "name": "麗清",
    "buyDate": "",
    "s2026": "",
    "s2025": "蜂王清新植感草本皂二入禮盒"
  },
  {
    "id": "3356",
    "code": "3356",
    "name": "奇偶",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "7-11美式咖啡卡"
  },
  {
    "id": "3360",
    "code": "3360",
    "name": "尚立",
    "buyDate": "",
    "s2026": "",
    "s2025": "旅香咖啡濾掛禮盒"
  },
  {
    "id": "3363",
    "code": "3363",
    "name": "上詮",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家便利商店 $35 禮物卡"
  },
  {
    "id": "3372",
    "code": "3372",
    "name": "典範",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "3373",
    "code": "3373",
    "name": "熱映",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "蜂王清新植感草本皂"
  },
  {
    "id": "3376",
    "code": "3376",
    "name": "新日興",
    "buyDate": "",
    "s2026": "",
    "s2025": "工具組"
  },
  {
    "id": "3379",
    "code": "3379",
    "name": "彬台",
    "buyDate": "",
    "s2026": "",
    "s2025": "香皂二入"
  },
  {
    "id": "3390",
    "code": "3390",
    "name": "旭軟",
    "buyDate": "04-15買",
    "s2026": "全家便利商店禮物卡 $50",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "3402",
    "code": "3402",
    "name": "漢科",
    "buyDate": "",
    "s2026": "",
    "s2025": "洗手乳"
  },
  {
    "id": "3419",
    "code": "3419",
    "name": "譁裕",
    "buyDate": "",
    "s2026": "",
    "s2025": "單顆香皂"
  },
  {
    "id": "3430",
    "code": "3430",
    "name": "奇鈦科",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "全家超商 $35 禮物卡"
  },
  {
    "id": "3437",
    "code": "3437",
    "name": "榮創",
    "buyDate": "",
    "s2026": "",
    "s2025": "茶山房3入串皂"
  },
  {
    "id": "3438",
    "code": "3438",
    "name": "類比科",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3441",
    "code": "3441",
    "name": "聯一光電",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "數據線收納包"
  },
  {
    "id": "3450",
    "code": "3450",
    "name": "聯鈞",
    "buyDate": "03-26買",
    "s2026": "印花樂山中健行琥珀茶色耐熱玻璃保鮮盒",
    "s2025": "多功能廚用組"
  },
  {
    "id": "3466",
    "code": "3466",
    "name": "德晉",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "3479",
    "code": "3479",
    "name": "安勤",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家中杯美式咖啡乙張"
  },
  {
    "id": "3481",
    "code": "3481",
    "name": "群創",
    "buyDate": "03-25買",
    "s2026": "時尚輕巧隨手杯",
    "s2025": "台灣產製真空包裝白米1公斤"
  },
  {
    "id": "3483",
    "code": "3483",
    "name": "力致",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "沙威隆經典抗菌皂二入"
  },
  {
    "id": "3484",
    "code": "3484",
    "name": "崧騰",
    "buyDate": "04-22買",
    "s2026": "餐具組",
    "s2025": "可立式藍芽自拍棒"
  },
  {
    "id": "3490",
    "code": "3490",
    "name": "單井",
    "buyDate": "03-25買",
    "s2026": "小蘇打去污粉汙劑 1組二入",
    "s2025": "香皂1組二入"
  },
  {
    "id": "3498",
    "code": "3498",
    "name": "陽程",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "3499",
    "code": "3499",
    "name": "環天科",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家超商商品卡 $35"
  },
  {
    "id": "3508",
    "code": "3508",
    "name": "位速",
    "buyDate": "04-15買",
    "s2026": "統一超商商品卡 $50",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "3518",
    "code": "3518",
    "name": "柏騰",
    "buyDate": "",
    "s2026": "",
    "s2025": "環保購物袋"
  },
  {
    "id": "3520",
    "code": "3520",
    "name": "華盈",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家商品卡 $35"
  },
  {
    "id": "3522",
    "code": "3522",
    "name": "御嵿",
    "buyDate": "",
    "s2026": "",
    "s2025": "御嵿集團品牌優惠券"
  },
  {
    "id": "3526",
    "code": "3526",
    "name": "凡甲",
    "buyDate": "",
    "s2026": "",
    "s2025": "蜂王清新植感草本皂二入盒"
  },
  {
    "id": "3527",
    "code": "3527",
    "name": "聚積",
    "buyDate": "",
    "s2026": "",
    "s2025": "保鮮袋1個"
  },
  {
    "id": "3535",
    "code": "3535",
    "name": "晶彩科",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "玻璃碗"
  },
  {
    "id": "3537",
    "code": "3537",
    "name": "堡達",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "3540",
    "code": "3540",
    "name": "曜越",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "3541",
    "code": "3541",
    "name": "西柏",
    "buyDate": "",
    "s2026": "",
    "s2025": "印製公司 LOGO 金屬桿原子筆 or 莫蘭迪色鋼筆(視庫存數量擇一發放)"
  },
  {
    "id": "3543",
    "code": "3543",
    "name": "州巧",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "香皂"
  },
  {
    "id": "3545",
    "code": "3545",
    "name": "敦泰",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "3546",
    "code": "3546",
    "name": "宇峻",
    "buyDate": "03-31買",
    "s2026": "不鏽鋼調味罐",
    "s2025": "安妮兔抽取超細纖維萬用布10抽"
  },
  {
    "id": "3548",
    "code": "3548",
    "name": "兆利",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "3550",
    "code": "3550",
    "name": "聯穎",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "3552",
    "code": "3552",
    "name": "同致",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "3556",
    "code": "3556",
    "name": "禾瑞亞",
    "buyDate": "03-25買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "3563",
    "code": "3563",
    "name": "牧德",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "宜睿 $50 禮券"
  },
  {
    "id": "3567",
    "code": "3567",
    "name": "逸昌",
    "buyDate": "",
    "s2026": "",
    "s2025": "收納袋"
  },
  {
    "id": "3576",
    "code": "3576",
    "name": "聯合再生",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "$35 7-11商品券"
  },
  {
    "id": "3580",
    "code": "3580",
    "name": "友威科",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "3588",
    "code": "3588",
    "name": "通嘉",
    "buyDate": "03-25買",
    "s2026": "便利商店提貨卡(美式咖啡)",
    "s2025": "便利商店提貨卡(美式咖啡)"
  },
  {
    "id": "3591",
    "code": "3591",
    "name": "艾笛森",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "7-11 $20 禮券"
  },
  {
    "id": "3592",
    "code": "3592",
    "name": "瑞鼎",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3593",
    "code": "3593",
    "name": "力銘",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡 ; 統一超商 $50 商品卡"
  },
  {
    "id": "3605",
    "code": "3605",
    "name": "宏致",
    "buyDate": "",
    "s2026": "",
    "s2025": "環保袋"
  },
  {
    "id": "3607",
    "code": "3607",
    "name": "谷崧",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家中杯美式咖啡券 ~ 2028-06-30"
  },
  {
    "id": "3615",
    "code": "3615",
    "name": "安可",
    "buyDate": "04-22買",
    "s2026": "洗衣機槽清洗錠",
    "s2025": "除霉凝膠"
  },
  {
    "id": "3624",
    "code": "3624",
    "name": "光頡",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "伊莎貝爾無患子洗手乳"
  },
  {
    "id": "3625",
    "code": "3625",
    "name": "西勝",
    "buyDate": "",
    "s2026": "",
    "s2025": "英國熊五合一螺絲工具組"
  },
  {
    "id": "3632",
    "code": "3632",
    "name": "研勤",
    "buyDate": "04-09買",
    "s2026": "包裝米",
    "s2025": "包裝米"
  },
  {
    "id": "3645",
    "code": "3645",
    "name": "達邁",
    "buyDate": "04-23買",
    "s2026": "未定",
    "s2025": "全家便利商店 $50 禮物卡"
  },
  {
    "id": "3646",
    "code": "3646",
    "name": "艾恩特",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "3666",
    "code": "3666",
    "name": "光耀",
    "buyDate": "04-15買",
    "s2026": "無",
    "s2025": "7-11超商商品卡 $50"
  },
  {
    "id": "3666",
    "code": "3666",
    "name": "光耀",
    "buyDate": "01-07買",
    "s2026": "無",
    "s2025": "7-11超商商品卡 $50"
  },
  {
    "id": "3673",
    "code": "3673",
    "name": "TPK-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "3686",
    "code": "3686",
    "name": "達能",
    "buyDate": "03-25買",
    "s2026": "7-11商品卡 $35",
    "s2025": "全家禮物卡 $35"
  },
  {
    "id": "3687",
    "code": "3687",
    "name": "歐買尬",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "統一超商 CITY CAFE/現萃茶實體提貨卡"
  },
  {
    "id": "3689",
    "code": "3689",
    "name": "湧德",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "三⽤觸控螢光原⼦筆"
  },
  {
    "id": "3693",
    "code": "3693",
    "name": "營邦",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "3702",
    "code": "3702",
    "name": "大聯大",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家便利商店 $50 禮券"
  },
  {
    "id": "3706",
    "code": "3706",
    "name": "神達",
    "buyDate": "03-25買",
    "s2026": "嘉禾牌家常麵無添加麵條",
    "s2025": "坎佩尼亞義大利麵"
  },
  {
    "id": "3708",
    "code": "3708",
    "name": "上緯投控",
    "buyDate": "03-25買",
    "s2026": "統一超商商品卡( $35 )",
    "s2025": "統一超商商品卡( $50 ) ; 統一超商商品卡( $35 )"
  },
  {
    "id": "3710",
    "code": "3710",
    "name": "連展投控",
    "buyDate": "",
    "s2026": "",
    "s2025": "銅離子立體口罩"
  },
  {
    "id": "3711",
    "code": "3711",
    "name": "日月光投控",
    "buyDate": "",
    "s2026": "",
    "s2025": "微波保鮮盒"
  },
  {
    "id": "3714",
    "code": "3714",
    "name": "富采",
    "buyDate": "03-25買",
    "s2026": "Ennostar x 懶散兔&啾先生聯名不鏽鋼餐具組",
    "s2025": "Ennostar x 黃阿瑪的後宮生活聯名不鏽鋼雙層碗"
  },
  {
    "id": "3715",
    "code": "3715",
    "name": "定穎投控",
    "buyDate": "02-05買",
    "s2026": "香皂二入",
    "s2025": "手工香皂"
  },
  {
    "id": "3715",
    "code": "3715",
    "name": "定穎投控",
    "buyDate": "",
    "s2026": "",
    "s2025": "手工香皂"
  },
  {
    "id": "3716",
    "code": "3716",
    "name": "中化控股",
    "buyDate": "03-25買",
    "s2026": "綠的抗菌潔手慕斯",
    "s2025": "綠的抗菌旅行組合"
  },
  {
    "id": "4102",
    "code": "4102",
    "name": "永日",
    "buyDate": "03-25買",
    "s2026": "香皂",
    "s2025": "常寶益生菌顆粒包"
  },
  {
    "id": "4105",
    "code": "4105",
    "name": "東洋",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "創益倍力莓(6入/盒)"
  },
  {
    "id": "4108",
    "code": "4108",
    "name": "懷特",
    "buyDate": "04-08買",
    "s2026": "清潔品",
    "s2025": "清潔品"
  },
  {
    "id": "4109",
    "code": "4109",
    "name": "加捷生醫",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "088粉紅拿鐵一盒（2入）"
  },
  {
    "id": "4111",
    "code": "4111",
    "name": "濟生",
    "buyDate": "04-08買",
    "s2026": "靚亮膠原蛋白",
    "s2025": "植萃草本精華油"
  },
  {
    "id": "4114",
    "code": "4114",
    "name": "健喬",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "發泡錠"
  },
  {
    "id": "4121",
    "code": "4121",
    "name": "優盛",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "佑全連鎖藥局 $50 禮物卡"
  },
  {
    "id": "4128",
    "code": "4128",
    "name": "中天",
    "buyDate": "03-19買",
    "s2026": "棉花田紅景天精華飲(30ml*5包/盒)",
    "s2025": "Exosome Essence 2000億外泌體精華液"
  },
  {
    "id": "4129",
    "code": "4129",
    "name": "聯合",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "電子行李秤"
  },
  {
    "id": "4130",
    "code": "4130",
    "name": "健亞",
    "buyDate": "02-11買",
    "s2026": "大容量便攜式防潮密封分裝藥盒",
    "s2025": "珪藻環保杯墊 ; 未定→撤銷"
  },
  {
    "id": "4132",
    "code": "4132",
    "name": "國鼎",
    "buyDate": "03-31買",
    "s2026": "樂扣樂扣雙飲口彈跳316保溫杯",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "4133",
    "code": "4133",
    "name": "亞諾法",
    "buyDate": "03-26買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "4142",
    "code": "4142",
    "name": "國光生",
    "buyDate": "03-31買",
    "s2026": "氣密保鮮罐",
    "s2025": "統一超商200元商品卡"
  },
  {
    "id": "4147",
    "code": "4147",
    "name": "中裕",
    "buyDate": "03-24買",
    "s2026": "超商 $50 商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4150",
    "code": "4150",
    "name": "優你康",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "全家 $50 禮物卡"
  },
  {
    "id": "4160",
    "code": "4160",
    "name": "訊聯基因",
    "buyDate": "",
    "s2026": "",
    "s2025": "Meta Exosome外泌體水光潤澤修護面膜"
  },
  {
    "id": "4162",
    "code": "4162",
    "name": "智擎",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "倍力莓"
  },
  {
    "id": "4163",
    "code": "4163",
    "name": "鐿鈦",
    "buyDate": "04-23買",
    "s2026": "未定",
    "s2025": "【黃阿瑪聯名】限定筆記本支架"
  },
  {
    "id": "4167",
    "code": "4167",
    "name": "松瑞藥",
    "buyDate": "",
    "s2026": "",
    "s2025": "沙威隆經典抗菌皂"
  },
  {
    "id": "4168",
    "code": "4168",
    "name": "醣聯",
    "buyDate": "",
    "s2026": "",
    "s2025": "廚房不鏽鋼料理剪刀"
  },
  {
    "id": "4171",
    "code": "4171",
    "name": "瑞基",
    "buyDate": "",
    "s2026": "",
    "s2025": "宜睿 $35 禮券 (即享卡)"
  },
  {
    "id": "4172",
    "code": "4172",
    "name": "因華",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "洗衣皂晶球"
  },
  {
    "id": "4173",
    "code": "4173",
    "name": "久裕",
    "buyDate": "",
    "s2026": "",
    "s2025": "面膜"
  },
  {
    "id": "4174",
    "code": "4174",
    "name": "浩鼎",
    "buyDate": "04-23買",
    "s2026": "超商 $35 禮物卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4195",
    "code": "4195",
    "name": "基米",
    "buyDate": "03-16買",
    "s2026": "小包平安米",
    "s2025": "極限野營登山扣環一個 ; 基米股東會大禮包"
  },
  {
    "id": "4195",
    "code": "4195",
    "name": "基米",
    "buyDate": "",
    "s2026": "",
    "s2025": "極限野營登山扣環一個 ; 基米股東會大禮包"
  },
  {
    "id": "4303",
    "code": "4303",
    "name": "信立",
    "buyDate": "03-19買",
    "s2026": "【朝和生醫】保健產品乙包",
    "s2025": "【朝和生醫】愛視泌EX金盞草外泌體複方膠囊(全素)乙包"
  },
  {
    "id": "4306",
    "code": "4306",
    "name": "炎洲",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4402",
    "code": "4402",
    "name": "郡都開發",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "4510",
    "code": "4510",
    "name": "高鋒",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4513",
    "code": "4513",
    "name": "福裕",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "4523",
    "code": "4523",
    "name": "永彰",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 統一超商中杯美式咖啡卡"
  },
  {
    "id": "4530",
    "code": "4530",
    "name": "宏易",
    "buyDate": "",
    "s2026": "",
    "s2025": "四件式小麥餐具組"
  },
  {
    "id": "4533",
    "code": "4533",
    "name": "協易機",
    "buyDate": "04-08買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "4540",
    "code": "4540",
    "name": "全球傳動",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 (中杯美式)商品卡"
  },
  {
    "id": "4541",
    "code": "4541",
    "name": "晟田",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "4543",
    "code": "4543",
    "name": "萬在",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "安妮兔玻璃胖胖瓶"
  },
  {
    "id": "4552",
    "code": "4552",
    "name": "力達-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "沙威隆經典抗菌皂"
  },
  {
    "id": "4557",
    "code": "4557",
    "name": "永新-KY",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "精緻包裝米"
  },
  {
    "id": "4564",
    "code": "4564",
    "name": "元翎",
    "buyDate": "04-28買",
    "s2026": "洗碗精",
    "s2025": "洗碗精"
  },
  {
    "id": "4566",
    "code": "4566",
    "name": "時碩工業",
    "buyDate": "04-08買",
    "s2026": "折疊休閒帽",
    "s2025": "環保手提袋"
  },
  {
    "id": "4714",
    "code": "4714",
    "name": "永捷",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "【朝和生醫】愛視泌EX金盞草外泌體複方膠囊(全素)乙包"
  },
  {
    "id": "4716",
    "code": "4716",
    "name": "大立",
    "buyDate": "04-08買",
    "s2026": "濕紙巾",
    "s2025": "蜂王清新植感草本皂二入"
  },
  {
    "id": "4721",
    "code": "4721",
    "name": "美琪瑪",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4735",
    "code": "4735",
    "name": "豪展",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "4739",
    "code": "4739",
    "name": "康普",
    "buyDate": "03-24買",
    "s2026": "超商 $35 禮物卡",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "4743",
    "code": "4743",
    "name": "合一",
    "buyDate": "03-18買",
    "s2026": "棉花田紅景天精華飲(30ml*5包/盒)",
    "s2025": "Exosome Essence 2000億外泌體精華液"
  },
  {
    "id": "4744",
    "code": "4744",
    "name": "皇將",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "4746",
    "code": "4746",
    "name": "台耀",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11提貨卡 $35"
  },
  {
    "id": "4749",
    "code": "4749",
    "name": "新應材",
    "buyDate": "04-08買",
    "s2026": "7-11商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4754",
    "code": "4754",
    "name": "國碳科",
    "buyDate": "03-25買",
    "s2026": "酒精噴霧筆",
    "s2025": "酒精噴霧筆"
  },
  {
    "id": "4804",
    "code": "4804",
    "name": "大略-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $50 禮品卡"
  },
  {
    "id": "4806",
    "code": "4806",
    "name": "桂田文創",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "加捷-牛樟芝菌絲體精粹*1包"
  },
  {
    "id": "4903",
    "code": "4903",
    "name": "聯光通",
    "buyDate": "02-24買",
    "s2026": "牛樟芝菌絲體精粹飲(1入)",
    "s2025": "常健順暢益生菌"
  },
  {
    "id": "4906",
    "code": "4906",
    "name": "正文",
    "buyDate": "03-24買",
    "s2026": "指甲剪套裝組",
    "s2025": "指甲剪套裝組"
  },
  {
    "id": "4909",
    "code": "4909",
    "name": "新復興",
    "buyDate": "04-22買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "4912",
    "code": "4912",
    "name": "聯德控股-KY",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "4916",
    "code": "4916",
    "name": "事欣科",
    "buyDate": "03-26買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "4927",
    "code": "4927",
    "name": "泰鼎-KY",
    "buyDate": "02-24買",
    "s2026": "針織手提袋",
    "s2025": "可掛式擦手巾"
  },
  {
    "id": "4931",
    "code": "4931",
    "name": "新盛力",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "4934",
    "code": "4934",
    "name": "太極",
    "buyDate": "03-19買",
    "s2026": "超商商品卡 $35",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "4939",
    "code": "4939",
    "name": "亞電",
    "buyDate": "03-18買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "全家便利商店 $35 禮物卡"
  },
  {
    "id": "4956",
    "code": "4956",
    "name": "光鋐",
    "buyDate": "",
    "s2026": "",
    "s2025": "玻璃碗*1入"
  },
  {
    "id": "4960",
    "code": "4960",
    "name": "誠美材",
    "buyDate": "",
    "s2026": "",
    "s2025": "CMMT x 灣A麻吉聯名限定森活杯"
  },
  {
    "id": "4961",
    "code": "4961",
    "name": "天鈺",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "Edenred股東會好禮即享券【7-11或統一星巴克或全家便利商店】 $50 虛擬商品卡三擇一"
  },
  {
    "id": "4967",
    "code": "4967",
    "name": "十銓",
    "buyDate": "03-12買",
    "s2026": "未定",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "4968",
    "code": "4968",
    "name": "立積",
    "buyDate": "03-25買",
    "s2026": "全家便利商店 $50 禮物卡",
    "s2025": "全家便利商店 $50 禮物卡"
  },
  {
    "id": "4973",
    "code": "4973",
    "name": "廣穎電通",
    "buyDate": "",
    "s2026": "",
    "s2025": "妙管家公道先生洗潔精"
  },
  {
    "id": "4974",
    "code": "4974",
    "name": "亞泰",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "4976",
    "code": "4976",
    "name": "佳凌",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "統一超商45元咖啡卡"
  },
  {
    "id": "4977",
    "code": "4977",
    "name": "眾達-KY",
    "buyDate": "04-07買",
    "s2026": "全家 $35 禮物卡",
    "s2025": "宜睿好禮即享券 $35"
  },
  {
    "id": "4979",
    "code": "4979",
    "name": "華星光",
    "buyDate": "03-25買",
    "s2026": "統一超商中杯美式咖啡卡",
    "s2025": "統一超商中杯美式咖啡卡"
  },
  {
    "id": "4991",
    "code": "4991",
    "name": "環宇-KY",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "宜睿 $35 禮券 (A版)"
  },
  {
    "id": "4999",
    "code": "4999",
    "name": "鑫禾",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "廚房料理剪刀"
  },
  {
    "id": "5009",
    "code": "5009",
    "name": "榮剛",
    "buyDate": "03-25買",
    "s2026": "順暢益生菌",
    "s2025": "滋補強身 甲魚全沛"
  },
  {
    "id": "5011",
    "code": "5011",
    "name": "久陽",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "甲魚全沛全方位維他命一片(10粒)"
  },
  {
    "id": "5014",
    "code": "5014",
    "name": "建錩",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家中杯美式咖啡券 ~ 2028-06-30"
  },
  {
    "id": "5202",
    "code": "5202",
    "name": "力新",
    "buyDate": "03-18買",
    "s2026": "常健順暢益生菌",
    "s2025": "常健順暢益生菌"
  },
  {
    "id": "5203",
    "code": "5203",
    "name": "訊連",
    "buyDate": "",
    "s2026": "",
    "s2025": "CITY CAFE/現萃茶實體提貨卡"
  },
  {
    "id": "5210",
    "code": "5210",
    "name": "寶碩",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $35"
  },
  {
    "id": "5227",
    "code": "5227",
    "name": "立凱-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "5230",
    "code": "5230",
    "name": "雷笛克光學",
    "buyDate": "03-25買",
    "s2026": "香皂",
    "s2025": "香皂"
  },
  {
    "id": "5243",
    "code": "5243",
    "name": "乙盛-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "硅藻土杯墊 ; 記名鴻海集團股東福利 (開會通知)"
  },
  {
    "id": "5251",
    "code": "5251",
    "name": "天鉞電",
    "buyDate": "04-22買",
    "s2026": "香皂",
    "s2025": "肥皂"
  },
  {
    "id": "5258",
    "code": "5258",
    "name": "虹堡",
    "buyDate": "03-25買",
    "s2026": "乖乖純水濕巾",
    "s2025": "素色雙邊側袋保溫保冷袋"
  },
  {
    "id": "5262",
    "code": "5262",
    "name": "立達",
    "buyDate": "",
    "s2026": "",
    "s2025": "CC-7800B充電線"
  },
  {
    "id": "5272",
    "code": "5272",
    "name": "笙科",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "5283",
    "code": "5283",
    "name": "禾聯碩",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $100 禮券 ; 抗菌清潔組"
  },
  {
    "id": "5289",
    "code": "5289",
    "name": "宜鼎",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "5309",
    "code": "5309",
    "name": "系統電",
    "buyDate": "02-24買",
    "s2026": "不鏽鋼玻璃調料罐",
    "s2025": "碗筷組"
  },
  {
    "id": "5315",
    "code": "5315",
    "name": "光聯",
    "buyDate": "03-19買",
    "s2026": "愛心皂",
    "s2025": "台灣米"
  },
  {
    "id": "5328",
    "code": "5328",
    "name": "華容",
    "buyDate": "03-19買",
    "s2026": "真空壓縮收納袋組（附抽氣泵）",
    "s2025": "充電式磁吸感應燈"
  },
  {
    "id": "5351",
    "code": "5351",
    "name": "鈺創",
    "buyDate": "03-31買",
    "s2026": "全家便利商店 $50 商品卡",
    "s2025": "全家便利商店 $50 商品卡"
  },
  {
    "id": "5355",
    "code": "5355",
    "name": "佳總",
    "buyDate": "",
    "s2026": "",
    "s2025": "木漿清潔海棉"
  },
  {
    "id": "5356",
    "code": "5356",
    "name": "協益",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "萊爾富超商 $35 商品卡"
  },
  {
    "id": "5371",
    "code": "5371",
    "name": "中光電",
    "buyDate": "",
    "s2026": "",
    "s2025": "真空包裝米"
  },
  {
    "id": "5386",
    "code": "5386",
    "name": "青雲",
    "buyDate": "03-31買",
    "s2026": "肥皂組",
    "s2025": "肥皂組"
  },
  {
    "id": "5392",
    "code": "5392",
    "name": "能率",
    "buyDate": "",
    "s2026": "",
    "s2025": "糠炭美容皂"
  },
  {
    "id": "5398",
    "code": "5398",
    "name": "慕康生醫",
    "buyDate": "03-03買",
    "s2026": "超商 $50 商品卡",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "5410",
    "code": "5410",
    "name": "國眾",
    "buyDate": "03-24買",
    "s2026": "全家便利店中杯美式咖啡卡乙張",
    "s2025": "統一超商中杯美式咖啡卡乙張"
  },
  {
    "id": "5425",
    "code": "5425",
    "name": "台半",
    "buyDate": "",
    "s2026": "",
    "s2025": "宜睿好禮即享券 $50 【7-11、星巴克、全家三選一】"
  },
  {
    "id": "5438",
    "code": "5438",
    "name": "東友",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "超商咖啡提貨券"
  },
  {
    "id": "5439",
    "code": "5439",
    "name": "高技",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "5443",
    "code": "5443",
    "name": "均豪",
    "buyDate": "03-18買",
    "s2026": "磁吸可掛式開瓶器露營燈",
    "s2025": "矽膠摺疊杯"
  },
  {
    "id": "5452",
    "code": "5452",
    "name": "佶優",
    "buyDate": "04-14買",
    "s2026": "全家便利商店 $35 禮物卡",
    "s2025": "全家便利商店 $35 禮物卡"
  },
  {
    "id": "5460",
    "code": "5460",
    "name": "同協",
    "buyDate": "",
    "s2026": "",
    "s2025": "抹布"
  },
  {
    "id": "5471",
    "code": "5471",
    "name": "松翰",
    "buyDate": "04-15買",
    "s2026": "無",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "5478",
    "code": "5478",
    "name": "智冠",
    "buyDate": "",
    "s2026": "",
    "s2025": "MyCard點數卡100點 ~ 2026-06-30"
  },
  {
    "id": "5481",
    "code": "5481",
    "name": "新華",
    "buyDate": "01-28買",
    "s2026": "無",
    "s2025": "7-11 $35 禮券 ; 有發→撤銷 (原定: 7-11 $35 禮券)"
  },
  {
    "id": "5483",
    "code": "5483",
    "name": "中美晶",
    "buyDate": "03-25買",
    "s2026": "法蘭絨毯",
    "s2025": "耐熱玻璃盤"
  },
  {
    "id": "5484",
    "code": "5484",
    "name": "慧友",
    "buyDate": "03-18買",
    "s2026": "白人牙膏",
    "s2025": "白人牙膏"
  },
  {
    "id": "5488",
    "code": "5488",
    "name": "松普",
    "buyDate": "",
    "s2026": "",
    "s2025": "蜂王清新植感草本皂"
  },
  {
    "id": "5490",
    "code": "5490",
    "name": "同亨",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "5498",
    "code": "5498",
    "name": "凱崴",
    "buyDate": "",
    "s2026": "",
    "s2025": "超淨亮白洗衣精"
  },
  {
    "id": "5512",
    "code": "5512",
    "name": "力麒",
    "buyDate": "",
    "s2026": "",
    "s2025": "老媽拌麵(單包裝)"
  },
  {
    "id": "5521",
    "code": "5521",
    "name": "工信",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "電子行李秤"
  },
  {
    "id": "5536",
    "code": "5536",
    "name": "聖暉*",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "7-11 $50 商品卡"
  },
  {
    "id": "5603",
    "code": "5603",
    "name": "陸海",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "伊莎貝爾香皂"
  },
  {
    "id": "5608",
    "code": "5608",
    "name": "四維航",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家便利商店 $35 禮物卡"
  },
  {
    "id": "5609",
    "code": "5609",
    "name": "中菲行",
    "buyDate": "03-31買",
    "s2026": "鑰匙圈",
    "s2025": "手機環"
  },
  {
    "id": "5701",
    "code": "5701",
    "name": "劍湖山",
    "buyDate": "",
    "s2026": "",
    "s2025": "566洗髮露"
  },
  {
    "id": "5706",
    "code": "5706",
    "name": "鳳凰",
    "buyDate": "03-31買",
    "s2026": "鳳凰旅遊證件收納袋",
    "s2025": "鳳凰旅遊證件收納袋"
  },
  {
    "id": "5863",
    "code": "5863",
    "name": "瑞興銀",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "菱格紳士襪乙雙"
  },
  {
    "id": "5905",
    "code": "5905",
    "name": "南仁湖",
    "buyDate": "",
    "s2026": "",
    "s2025": "小墾丁渡假村住宿折3百券 ~ 2026-06-30"
  },
  {
    "id": "6005",
    "code": "6005",
    "name": "群益證",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "滾珠按摩器"
  },
  {
    "id": "6015",
    "code": "6015",
    "name": "宏遠證",
    "buyDate": "",
    "s2026": "",
    "s2025": "抽屜式快充數據收納組"
  },
  {
    "id": "6016",
    "code": "6016",
    "name": "康和證",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6026",
    "code": "6026",
    "name": "福邦證",
    "buyDate": "02-24買",
    "s2026": "伊莎貝爾櫻花香皂三入組(含抗菌配方)",
    "s2025": "伊莎貝爾櫻花香皂三入組(含抗菌配方)"
  },
  {
    "id": "6104",
    "code": "6104",
    "name": "創惟",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "6108",
    "code": "6108",
    "name": "競國",
    "buyDate": "04-15買",
    "s2026": "統一超商商品卡 $35",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "6109",
    "code": "6109",
    "name": "亞元",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "6111",
    "code": "6111",
    "name": "光聚晶電",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50 ; 7-11商品卡 $50"
  },
  {
    "id": "6116",
    "code": "6116",
    "name": "彩晶",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "6120",
    "code": "6120",
    "name": "達運",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "6122",
    "code": "6122",
    "name": "擎邦",
    "buyDate": "",
    "s2026": "",
    "s2025": "修容組"
  },
  {
    "id": "6125",
    "code": "6125",
    "name": "廣運",
    "buyDate": "03-18買",
    "s2026": "便利商店禮物卡 $35",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "6126",
    "code": "6126",
    "name": "信音",
    "buyDate": "",
    "s2026": "",
    "s2025": "三折自動傘(顏色隨機)"
  },
  {
    "id": "6127",
    "code": "6127",
    "name": "九豪",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "6129",
    "code": "6129",
    "name": "普誠",
    "buyDate": "04-15買",
    "s2026": "全家 $50 禮券",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "6130",
    "code": "6130",
    "name": "上亞科技",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡 $100 ; 沙威隆經典抗菌皂二入"
  },
  {
    "id": "6136",
    "code": "6136",
    "name": "富爾特",
    "buyDate": "04-15買",
    "s2026": "手工香皂",
    "s2025": "精油噴霧"
  },
  {
    "id": "6142",
    "code": "6142",
    "name": "友勁",
    "buyDate": "03-25買",
    "s2026": "神守精華膠囊",
    "s2025": "甲魚全沛綜合營養膠囊"
  },
  {
    "id": "6143",
    "code": "6143",
    "name": "振曜",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "6147",
    "code": "6147",
    "name": "頎邦",
    "buyDate": "03-25買",
    "s2026": "環保摺疊購物袋",
    "s2025": "摺疊手把露營鋼杯"
  },
  {
    "id": "6148",
    "code": "6148",
    "name": "驊宏資",
    "buyDate": "",
    "s2026": "",
    "s2025": "多功能觸控原子筆"
  },
  {
    "id": "6150",
    "code": "6150",
    "name": "撼訊",
    "buyDate": "04-14買",
    "s2026": "時尚輕巧隨手杯200ml",
    "s2025": "氣密保鮮罐0.57L"
  },
  {
    "id": "6151",
    "code": "6151",
    "name": "晉倫",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "香皂"
  },
  {
    "id": "6152",
    "code": "6152",
    "name": "百一",
    "buyDate": "",
    "s2026": "",
    "s2025": "香皂旅行組"
  },
  {
    "id": "6153",
    "code": "6153",
    "name": "嘉聯益",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "指甲剪(含皮套)"
  },
  {
    "id": "6156",
    "code": "6156",
    "name": "松上",
    "buyDate": "03-26買",
    "s2026": "香皂",
    "s2025": "清潔用品"
  },
  {
    "id": "6158",
    "code": "6158",
    "name": "禾昌",
    "buyDate": "03-25買",
    "s2026": "愛心手工皂",
    "s2025": "愛心手工皂"
  },
  {
    "id": "6160",
    "code": "6160",
    "name": "欣技",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11( $35 咖啡卡)"
  },
  {
    "id": "6161",
    "code": "6161",
    "name": "捷波",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "蜂王清新植感草本皂"
  },
  {
    "id": "6163",
    "code": "6163",
    "name": "華電網",
    "buyDate": "",
    "s2026": "",
    "s2025": "三合一數據線"
  },
  {
    "id": "6164",
    "code": "6164",
    "name": "華興",
    "buyDate": "03-25買",
    "s2026": "妙管家洗潔精",
    "s2025": "妙管家濃縮洗衣精"
  },
  {
    "id": "6167",
    "code": "6167",
    "name": "久正",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "環保肥皂"
  },
  {
    "id": "6169",
    "code": "6169",
    "name": "昱泉",
    "buyDate": "",
    "s2026": "",
    "s2025": "多功能雙面砧板"
  },
  {
    "id": "6170",
    "code": "6170",
    "name": "統振",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "電池"
  },
  {
    "id": "6179",
    "code": "6179",
    "name": "亞通",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $100 ; 全家禮物卡 $50"
  },
  {
    "id": "6182",
    "code": "6182",
    "name": "合晶",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "6185",
    "code": "6185",
    "name": "幃翔",
    "buyDate": "04-09買",
    "s2026": "好無比洗衣精",
    "s2025": "好無比洗衣精"
  },
  {
    "id": "6186",
    "code": "6186",
    "name": "新潤",
    "buyDate": "04-22買",
    "s2026": "7-11商品卡",
    "s2025": "7-11 $100 禮券"
  },
  {
    "id": "6187",
    "code": "6187",
    "name": "萬潤",
    "buyDate": "04-23買",
    "s2026": "全家咖啡商品卡",
    "s2025": "全家中杯美式咖啡券 ~ 2027-06-30"
  },
  {
    "id": "6188",
    "code": "6188",
    "name": "廣明",
    "buyDate": "03-25買",
    "s2026": "蜂王清新植萃精華皂二入(70g)",
    "s2025": "菲蘇德美燕麥潔膚皂二入(80g)"
  },
  {
    "id": "6189",
    "code": "6189",
    "name": "豐藝",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "6190",
    "code": "6190",
    "name": "萬泰科",
    "buyDate": "03-24買",
    "s2026": "萬泰ACT超透氣口罩",
    "s2025": "萬泰ACT超透氣口罩"
  },
  {
    "id": "6191",
    "code": "6191",
    "name": "精成科",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "黃麻購物袋一個"
  },
  {
    "id": "6202",
    "code": "6202",
    "name": "盛群",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "統一商品卡 $50"
  },
  {
    "id": "6204",
    "code": "6204",
    "name": "艾華",
    "buyDate": "03-18買",
    "s2026": "無",
    "s2025": "高露潔旅行組+好來旅行組"
  },
  {
    "id": "6207",
    "code": "6207",
    "name": "雷科",
    "buyDate": "03-31買",
    "s2026": "牛樟芝菌絲體膠囊10粒入/盒",
    "s2025": "維生素CDE+鋅複方膠囊"
  },
  {
    "id": "6209",
    "code": "6209",
    "name": "今國光",
    "buyDate": "",
    "s2026": "",
    "s2025": "沙威隆經典抗菌皂二入"
  },
  {
    "id": "6214",
    "code": "6214",
    "name": "精誠",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "硅藻土廚房吸水桌墊"
  },
  {
    "id": "6215",
    "code": "6215",
    "name": "和椿",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "6216",
    "code": "6216",
    "name": "居易",
    "buyDate": "",
    "s2026": "",
    "s2025": "輕薄辦公室便利貼"
  },
  {
    "id": "6217",
    "code": "6217",
    "name": "中探針",
    "buyDate": "04-21買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "6218",
    "code": "6218",
    "name": "豪勉",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "6220",
    "code": "6220",
    "name": "岳豐",
    "buyDate": "",
    "s2026": "",
    "s2025": "環保餐具"
  },
  {
    "id": "6223",
    "code": "6223",
    "name": "旺矽",
    "buyDate": "04-15買",
    "s2026": "統一超商商品卡 $50",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "6224",
    "code": "6224",
    "name": "聚鼎",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6226",
    "code": "6226",
    "name": "光鼎",
    "buyDate": "04-08買",
    "s2026": "蜂王草本皂80g",
    "s2025": "蜂王草本皂80g"
  },
  {
    "id": "6229",
    "code": "6229",
    "name": "研通",
    "buyDate": "04-28買",
    "s2026": "捲尺",
    "s2025": "香皂"
  },
  {
    "id": "6231",
    "code": "6231",
    "name": "系微",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "草本皂二入"
  },
  {
    "id": "6233",
    "code": "6233",
    "name": "旺玖",
    "buyDate": "04-08買",
    "s2026": "全家便利商店 $35 禮物卡",
    "s2025": "全家便利商店 $35 禮物卡"
  },
  {
    "id": "6235",
    "code": "6235",
    "name": "華孚",
    "buyDate": "03-19買",
    "s2026": "有機白米",
    "s2025": "有機白米"
  },
  {
    "id": "6237",
    "code": "6237",
    "name": "驊訊",
    "buyDate": "04-23買",
    "s2026": "統一超商商品卡 $50",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "6239",
    "code": "6239",
    "name": "力成",
    "buyDate": "03-25買",
    "s2026": "統一超商商品卡 $50",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "6241",
    "code": "6241",
    "name": "鑫永洋",
    "buyDate": "02-24買",
    "s2026": "順暢益生菌(2入)",
    "s2025": "精神旺盛 牛樟芝菌絲體x薑黃精粹飲(1入) ; 常健順暢益生菌(2入)"
  },
  {
    "id": "6243",
    "code": "6243",
    "name": "迅杰",
    "buyDate": "04-15買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6244",
    "code": "6244",
    "name": "茂迪",
    "buyDate": "",
    "s2026": "",
    "s2025": "優選經典米"
  },
  {
    "id": "6246",
    "code": "6246",
    "name": "臺龍",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "初見海洋之星玻璃盤1入"
  },
  {
    "id": "6248",
    "code": "6248",
    "name": "沛波",
    "buyDate": "03-24買",
    "s2026": "滋補強身 甲魚全沛",
    "s2025": "常健順暢益生菌"
  },
  {
    "id": "6257",
    "code": "6257",
    "name": "矽格",
    "buyDate": "03-26買",
    "s2026": "7-11商品卡 $50",
    "s2025": "7-11商品卡 $50"
  },
  {
    "id": "6261",
    "code": "6261",
    "name": "久元",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "7-11商品券 $35"
  },
  {
    "id": "6266",
    "code": "6266",
    "name": "泰詠",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "宜睿 $35 禮券"
  },
  {
    "id": "6269",
    "code": "6269",
    "name": "台郡",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家 $50 禮物卡"
  },
  {
    "id": "6270",
    "code": "6270",
    "name": "倍微",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "草本皂"
  },
  {
    "id": "6271",
    "code": "6271",
    "name": "同欣電",
    "buyDate": "03-24買",
    "s2026": "妙管家八倍濃縮洗衣球",
    "s2025": "妙管家八倍濃縮洗衣球"
  },
  {
    "id": "6275",
    "code": "6275",
    "name": "元山",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "濕紙巾"
  },
  {
    "id": "6276",
    "code": "6276",
    "name": "安鈦克",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "7-11 中杯美式咖啡卡"
  },
  {
    "id": "6282",
    "code": "6282",
    "name": "康舒",
    "buyDate": "03-25買",
    "s2026": "鋅合金編織充電線",
    "s2025": "多功能鑰匙扣燈"
  },
  {
    "id": "6284",
    "code": "6284",
    "name": "佳邦",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11商品卡 $35"
  },
  {
    "id": "6290",
    "code": "6290",
    "name": "良維",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "折疊環保購物袋"
  },
  {
    "id": "6411",
    "code": "6411",
    "name": "晶焱",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 商品卡 $50"
  },
  {
    "id": "6419",
    "code": "6419",
    "name": "京晨科",
    "buyDate": "04-23買",
    "s2026": "未定",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "6419",
    "code": "6419",
    "name": "京晨科",
    "buyDate": "01-23買",
    "s2026": "全家便利商店禮物卡 $50",
    "s2025": "全家便利商店禮物卡 $50"
  },
  {
    "id": "6432",
    "code": "6432",
    "name": "今展科",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮贈卡 ~ 2028-06-30"
  },
  {
    "id": "6438",
    "code": "6438",
    "name": "迅得",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "全家便利商店 $50 禮物卡"
  },
  {
    "id": "6441",
    "code": "6441",
    "name": "廣錠",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "統一超商25元商品卡"
  },
  {
    "id": "6443",
    "code": "6443",
    "name": "元晶",
    "buyDate": "03-19買",
    "s2026": "全家便利商店 $50 禮券",
    "s2025": "全家便利商店 $50 禮券"
  },
  {
    "id": "6461",
    "code": "6461",
    "name": "益得",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "微肌意識金潤面膜"
  },
  {
    "id": "6470",
    "code": "6470",
    "name": "宇智",
    "buyDate": "",
    "s2026": "",
    "s2025": "真空壓縮衣物收納袋"
  },
  {
    "id": "6473",
    "code": "6473",
    "name": "美賣*",
    "buyDate": "",
    "s2026": "",
    "s2025": "美賣商城 85 折優惠券 10 張"
  },
  {
    "id": "6477",
    "code": "6477",
    "name": "安集",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "草本皂"
  },
  {
    "id": "6483",
    "code": "6483",
    "name": "原創生醫",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品券 $50"
  },
  {
    "id": "6486",
    "code": "6486",
    "name": "互動",
    "buyDate": "03-18買",
    "s2026": "全家便利商店禮物卡 $35",
    "s2025": "全家便利商店禮物卡 $35"
  },
  {
    "id": "6492",
    "code": "6492",
    "name": "生華科",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "6494",
    "code": "6494",
    "name": "九齊",
    "buyDate": "03-19買",
    "s2026": "香皂",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "6509",
    "code": "6509",
    "name": "聚和",
    "buyDate": "03-25買",
    "s2026": "自黏性便條紙",
    "s2025": "自黏性便條紙"
  },
  {
    "id": "6530",
    "code": "6530",
    "name": "創威",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "全家超商禮物卡 $100"
  },
  {
    "id": "6531",
    "code": "6531",
    "name": "愛普*",
    "buyDate": "03-05買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6532",
    "code": "6532",
    "name": "瑞耘",
    "buyDate": "03-19買",
    "s2026": "未定 (股務資料: 物品)",
    "s2025": "超商中杯美式咖啡卡"
  },
  {
    "id": "6533",
    "code": "6533",
    "name": "晶心科",
    "buyDate": "03-25買",
    "s2026": "無",
    "s2025": "全家商品禮券 $50"
  },
  {
    "id": "6538",
    "code": "6538",
    "name": "倉和",
    "buyDate": "03-25買",
    "s2026": "7-11 商品卡 $50",
    "s2025": "7-11 商品卡 $50"
  },
  {
    "id": "6543",
    "code": "6543",
    "name": "普惠醫工",
    "buyDate": "03-04買",
    "s2026": "無",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "6547",
    "code": "6547",
    "name": "高端疫苗",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券 ; 潔手用品"
  },
  {
    "id": "6549",
    "code": "6549",
    "name": "景凱",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "廚房不銹鋼料理剪刀"
  },
  {
    "id": "6558",
    "code": "6558",
    "name": "興能高",
    "buyDate": "03-25買",
    "s2026": "香皂",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "6568",
    "code": "6568",
    "name": "宏觀",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "全家中杯美式咖啡券 ~ 2028-06-30"
  },
  {
    "id": "6578",
    "code": "6578",
    "name": "達邦蛋白",
    "buyDate": "03-19買",
    "s2026": "無",
    "s2025": "精釀咖啡隨身包"
  },
  {
    "id": "6586",
    "code": "6586",
    "name": "醣基",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "6588",
    "code": "6588",
    "name": "東典光電",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "宜睿好禮即享券( $50 ) ; 宜睿好禮即享券( $100 )"
  },
  {
    "id": "6591",
    "code": "6591",
    "name": "動力-KY",
    "buyDate": "03-25買",
    "s2026": "全家便利商店-禮物卡 ( $50 )",
    "s2025": "全家便利商店-禮物卡 ( $50 )"
  },
  {
    "id": "6593",
    "code": "6593",
    "name": "台灣銘板",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "7-11商品卡 $35"
  },
  {
    "id": "6598",
    "code": "6598",
    "name": "ABC-KY",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "全家超商 $35 商品卡"
  },
  {
    "id": "6618",
    "code": "6618",
    "name": "永虹先進",
    "buyDate": "04-28買",
    "s2026": "超商 $50 商品卡",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "6620",
    "code": "6620",
    "name": "漢達",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6621",
    "code": "6621",
    "name": "華宇藥",
    "buyDate": "03-17買",
    "s2026": "統一超商 $50 商品卡",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6657",
    "code": "6657",
    "name": "華安",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "沙威隆經典抗菌皂"
  },
  {
    "id": "6665",
    "code": "6665",
    "name": "康聯生醫",
    "buyDate": "03-26買",
    "s2026": "無",
    "s2025": "記名鴻海集團股東福利 (開會通知)"
  },
  {
    "id": "6672",
    "code": "6672",
    "name": "騰輝電子-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "$50 全家便利商店禮物卡"
  },
  {
    "id": "6683",
    "code": "6683",
    "name": "雍智科技",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6684",
    "code": "6684",
    "name": "安格",
    "buyDate": "",
    "s2026": "",
    "s2025": "炫彩時尚杯一個 ; 保溫袋1個"
  },
  {
    "id": "6698",
    "code": "6698",
    "name": "旭暉應材",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "手提保溫保冰便當袋"
  },
  {
    "id": "6703",
    "code": "6703",
    "name": "軒郁",
    "buyDate": "03-25買",
    "s2026": "膠原飲品",
    "s2025": "膠原飲品"
  },
  {
    "id": "6706",
    "code": "6706",
    "name": "惠特",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6712",
    "code": "6712",
    "name": "長聖",
    "buyDate": "02-11買",
    "s2026": "7-11 $50 購物金 ~ 2026-10-31^",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6727",
    "code": "6727",
    "name": "亞泰金屬",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡，200元"
  },
  {
    "id": "6742",
    "code": "6742",
    "name": "澤米",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $50 禮物卡"
  },
  {
    "id": "6761",
    "code": "6761",
    "name": "穩得",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "香皂禮盒"
  },
  {
    "id": "6770",
    "code": "6770",
    "name": "力積電",
    "buyDate": "02-05買",
    "s2026": "統一超商 $100 商品卡",
    "s2025": "統一超商 $100 商品卡"
  },
  {
    "id": "6786",
    "code": "6786",
    "name": "芯測",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家禮物卡 $100"
  },
  {
    "id": "6787",
    "code": "6787",
    "name": "晶瑞光",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "保溫杯"
  },
  {
    "id": "6788",
    "code": "6788",
    "name": "華景電",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "精美濾掛咖啡"
  },
  {
    "id": "6793",
    "code": "6793",
    "name": "天力離岸",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "6797",
    "code": "6797",
    "name": "圓點奈米",
    "buyDate": "",
    "s2026": "",
    "s2025": "City Cafe 提貨卡"
  },
  {
    "id": "6799",
    "code": "6799",
    "name": "來頡",
    "buyDate": "03-19買",
    "s2026": "未定",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "6810",
    "code": "6810",
    "name": "新穎生醫",
    "buyDate": "04-15買",
    "s2026": "未定",
    "s2025": "$35 超商咖啡券"
  },
  {
    "id": "6876",
    "code": "6876",
    "name": "朗齊生醫*",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家禮物卡 $50 ; 全家禮物卡 $100"
  },
  {
    "id": "6885",
    "code": "6885",
    "name": "全福生技",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "7402",
    "code": "7402",
    "name": "邑錡",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "7516",
    "code": "7516",
    "name": "清淨海",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "泰迪熊 精緻衣物手洗精 1000g乙瓶"
  },
  {
    "id": "7566",
    "code": "7566",
    "name": "亞果遊艇",
    "buyDate": "04-15買",
    "s2026": "無",
    "s2025": "墨鏡"
  },
  {
    "id": "7719",
    "code": "7719",
    "name": "碳基",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "7769",
    "code": "7769",
    "name": "鴻勁",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $100 禮券"
  },
  {
    "id": "7780",
    "code": "7780",
    "name": "大研生醫*",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "官網滿990折680代碼 ~ 2026-06-30"
  },
  {
    "id": "8011",
    "code": "8011",
    "name": "台通",
    "buyDate": "03-24買",
    "s2026": "野餐墊",
    "s2025": "毛寶洗衣精"
  },
  {
    "id": "8016",
    "code": "8016",
    "name": "矽創",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "8021",
    "code": "8021",
    "name": "尖點",
    "buyDate": "03-25買",
    "s2026": "公益沐浴球",
    "s2025": "LED觸控發光筆"
  },
  {
    "id": "8024",
    "code": "8024",
    "name": "佑華",
    "buyDate": "",
    "s2026": "",
    "s2025": "蜂王精美香皂"
  },
  {
    "id": "8028",
    "code": "8028",
    "name": "昇陽半導體",
    "buyDate": "03-18買",
    "s2026": "原木隔熱桌墊",
    "s2025": "多用途承置架"
  },
  {
    "id": "8032",
    "code": "8032",
    "name": "光菱",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "環保提袋"
  },
  {
    "id": "8034",
    "code": "8034",
    "name": "榮群",
    "buyDate": "",
    "s2026": "",
    "s2025": "香皂"
  },
  {
    "id": "8038",
    "code": "8038",
    "name": "長園科",
    "buyDate": "",
    "s2026": "",
    "s2025": "妙管家手提玻璃晶靓杯"
  },
  {
    "id": "8048",
    "code": "8048",
    "name": "德勝",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "8049",
    "code": "8049",
    "name": "晶采",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "時尚保溫袋"
  },
  {
    "id": "8050",
    "code": "8050",
    "name": "廣積",
    "buyDate": "",
    "s2026": "",
    "s2025": "攜帶型手機支架"
  },
  {
    "id": "8064",
    "code": "8064",
    "name": "東捷",
    "buyDate": "03-25買",
    "s2026": "統一超商 $35 商品卡",
    "s2025": "統一超商 $35 商品卡"
  },
  {
    "id": "8066",
    "code": "8066",
    "name": "來思達",
    "buyDate": "03-31買",
    "s2026": "伊莎貝爾櫻花香皂二入",
    "s2025": "蜂王清新植感草本皂二入"
  },
  {
    "id": "8069",
    "code": "8069",
    "name": "元太",
    "buyDate": "03-25買",
    "s2026": "GREEN & SAFE 蔬果碗盤清潔液體皂",
    "s2025": "GREEN & SAFE義大利高燃點葵花籽油"
  },
  {
    "id": "8071",
    "code": "8071",
    "name": "能率網通",
    "buyDate": "",
    "s2026": "",
    "s2025": "稻回皂 糠碳美容皂"
  },
  {
    "id": "8074",
    "code": "8074",
    "name": "鉅橡",
    "buyDate": "02-24買",
    "s2026": "電木梳1支",
    "s2025": "防靜電高級電木梳1支"
  },
  {
    "id": "8076",
    "code": "8076",
    "name": "伍豐",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $100"
  },
  {
    "id": "8085",
    "code": "8085",
    "name": "福華",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "8086",
    "code": "8086",
    "name": "宏捷科",
    "buyDate": "03-25買",
    "s2026": "統一超商咖啡卡 $35",
    "s2025": "統一超商商品卡 $50"
  },
  {
    "id": "8087",
    "code": "8087",
    "name": "麗升能源",
    "buyDate": "04-09買",
    "s2026": "無",
    "s2025": "香草手工皂禮盒(2顆)"
  },
  {
    "id": "8087",
    "code": "8087",
    "name": "麗升能源",
    "buyDate": "02-11買",
    "s2026": "無 (撤銷)",
    "s2025": "香草手工皂禮盒(2顆)"
  },
  {
    "id": "8088",
    "code": "8088",
    "name": "品安",
    "buyDate": "04-09買",
    "s2026": "未定",
    "s2025": "統一超商商品卡 $35"
  },
  {
    "id": "8089",
    "code": "8089",
    "name": "康全電訊",
    "buyDate": "04-15買",
    "s2026": "蜂王清新植萃精華皂",
    "s2025": "蜂王清新植感草本皂"
  },
  {
    "id": "8092",
    "code": "8092",
    "name": "建暐",
    "buyDate": "",
    "s2026": "",
    "s2025": "口罩一盒"
  },
  {
    "id": "8096",
    "code": "8096",
    "name": "擎亞",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "8104",
    "code": "8104",
    "name": "錸寶",
    "buyDate": "",
    "s2026": "",
    "s2025": "除霉凝膠"
  },
  {
    "id": "8107",
    "code": "8107",
    "name": "大億金茂",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "8111",
    "code": "8111",
    "name": "立碁",
    "buyDate": "03-26買",
    "s2026": "清淨海洗衣膠囊",
    "s2025": "清淨海檸檬洗衣膠囊"
  },
  {
    "id": "8112",
    "code": "8112",
    "name": "至上",
    "buyDate": "03-25買",
    "s2026": "無患子抗菌清潔組",
    "s2025": "皂就幸福手工皂"
  },
  {
    "id": "8119",
    "code": "8119",
    "name": "公信",
    "buyDate": "03-31買",
    "s2026": "超商商品卡 $35",
    "s2025": "7-11 $35 禮券"
  },
  {
    "id": "8150",
    "code": "8150",
    "name": "南茂",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "$50 7-11商品卡"
  },
  {
    "id": "8163",
    "code": "8163",
    "name": "達方",
    "buyDate": "03-25買",
    "s2026": "保冰袋",
    "s2025": "日式斗笠碗禮盒組(2入))"
  },
  {
    "id": "8176",
    "code": "8176",
    "name": "智捷",
    "buyDate": "03-18買",
    "s2026": "香皂*1",
    "s2025": "舒緩皂*1"
  },
  {
    "id": "8183",
    "code": "8183",
    "name": "精星",
    "buyDate": "04-15買",
    "s2026": "FDK三號鹼性電池(4入一組)",
    "s2025": "無印風黃麻購物袋一個"
  },
  {
    "id": "8213",
    "code": "8213",
    "name": "志超",
    "buyDate": "03-25買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "8215",
    "code": "8215",
    "name": "明基材",
    "buyDate": "03-25買",
    "s2026": "護妍天使亮白水潤雙星保養限定組",
    "s2025": "護妍天使全方位煥膚淨亮限定組"
  },
  {
    "id": "8222",
    "code": "8222",
    "name": "寶一",
    "buyDate": "04-22買",
    "s2026": "濾掛式咖啡包2入",
    "s2025": "濾掛式咖啡包2入"
  },
  {
    "id": "8227",
    "code": "8227",
    "name": "巨有科技",
    "buyDate": "03-18買",
    "s2026": "高露潔牙膏牙刷旅行組",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "8240",
    "code": "8240",
    "name": "華宏",
    "buyDate": "03-24買",
    "s2026": "無",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "8249",
    "code": "8249",
    "name": "菱光",
    "buyDate": "03-24買",
    "s2026": "未定",
    "s2025": "伊甸庇護工場公益香皂禮盒"
  },
  {
    "id": "8261",
    "code": "8261",
    "name": "富鼎",
    "buyDate": "03-25買",
    "s2026": "妙管家煥彩香氛洗衣球",
    "s2025": "超商咖啡卡 $35"
  },
  {
    "id": "8277",
    "code": "8277",
    "name": "商丞",
    "buyDate": "04-08買",
    "s2026": "未定",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "8289",
    "code": "8289",
    "name": "泰藝",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "多功能削皮器"
  },
  {
    "id": "8299",
    "code": "8299",
    "name": "群聯",
    "buyDate": "03-25買",
    "s2026": "全家禮物卡 $100",
    "s2025": "全家禮物卡 $50"
  },
  {
    "id": "8358",
    "code": "8358",
    "name": "金居",
    "buyDate": "04-07買",
    "s2026": "未定",
    "s2025": "統一超商 $50 禮物卡"
  },
  {
    "id": "8383",
    "code": "8383",
    "name": "千附",
    "buyDate": "03-26買",
    "s2026": "蜂王拾光漫遊經典皂二入盒",
    "s2025": "統一超商 $50 商品卡"
  },
  {
    "id": "8390",
    "code": "8390",
    "name": "金益鼎",
    "buyDate": "",
    "s2026": "",
    "s2025": "抗菌洗手露1罐"
  },
  {
    "id": "8409",
    "code": "8409",
    "name": "商之器",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "安妮兔方型一碗一匙"
  },
  {
    "id": "8429",
    "code": "8429",
    "name": "金麗-KY",
    "buyDate": "04-22買",
    "s2026": "未定",
    "s2025": "咖啡提領卡"
  },
  {
    "id": "8431",
    "code": "8431",
    "name": "匯鑽科",
    "buyDate": "04-14買",
    "s2026": "未定",
    "s2025": "統一 $100 禮物卡 ; 統一 $50 禮物卡"
  },
  {
    "id": "8436",
    "code": "8436",
    "name": "大江",
    "buyDate": "",
    "s2026": "",
    "s2025": "至尊膠原面膜限量盲盒"
  },
  {
    "id": "8437",
    "code": "8437",
    "name": "大地-KY",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家禮品卡 $50"
  },
  {
    "id": "8440",
    "code": "8440",
    "name": "綠電",
    "buyDate": "02-24買",
    "s2026": "7-11 $35 商品卡",
    "s2025": "7-11商品卡 $100"
  },
  {
    "id": "8487",
    "code": "8487",
    "name": "愛爾達-創",
    "buyDate": "03-18買",
    "s2026": "未定",
    "s2025": "Taiwan GO應援毛巾"
  },
  {
    "id": "8489",
    "code": "8489",
    "name": "三貝德",
    "buyDate": "12-19買",
    "s2026": "口袋學校30天體驗序號 ~ 2026-03-31^",
    "s2025": "統一超商 $50 商品卡 ; 數位學習課程體驗券"
  },
  {
    "id": "8489",
    "code": "8489",
    "name": "三貝德",
    "buyDate": "",
    "s2026": "",
    "s2025": "統一超商 $50 商品卡 ; 數位學習課程體驗券"
  },
  {
    "id": "8916",
    "code": "8916",
    "name": "光隆",
    "buyDate": "03-26買",
    "s2026": "未定",
    "s2025": "7-11 $50 禮券"
  },
  {
    "id": "8927",
    "code": "8927",
    "name": "北基",
    "buyDate": "",
    "s2026": "",
    "s2025": "25元公司油票"
  },
  {
    "id": "8933",
    "code": "8933",
    "name": "愛地雅",
    "buyDate": "03-26買",
    "s2026": "香皂",
    "s2025": "伊莎貝爾香皂"
  },
  {
    "id": "8935",
    "code": "8935",
    "name": "邦泰",
    "buyDate": "03-31買",
    "s2026": "未定",
    "s2025": "法國Luminarc晶鑽浮雕盤"
  },
  {
    "id": "8936",
    "code": "8936",
    "name": "國統",
    "buyDate": "03-25買",
    "s2026": "7-11咖啡券 $35",
    "s2025": "保溫保冷袋"
  },
  {
    "id": "9902",
    "code": "9902",
    "name": "台火",
    "buyDate": "04-22買",
    "s2026": "香皂",
    "s2025": "香皂"
  },
  {
    "id": "9912",
    "code": "9912",
    "name": "偉聯",
    "buyDate": "",
    "s2026": "",
    "s2025": "全家 $35 禮券"
  },
  {
    "id": "9914",
    "code": "9914",
    "name": "美利達",
    "buyDate": "",
    "s2026": "",
    "s2025": "7-11 $100 禮券"
  },
  {
    "id": "9919",
    "code": "9919",
    "name": "康那香",
    "buyDate": "",
    "s2026": "",
    "s2025": "口罩"
  },
  {
    "id": "9935",
    "code": "9935",
    "name": "慶豐富",
    "buyDate": "03-19買",
    "s2026": "全家商品券",
    "s2025": "全家 $50 禮券"
  },
  {
    "id": "9958",
    "code": "9958",
    "name": "世紀鋼",
    "buyDate": "03-24買",
    "s2026": "青花瓷手柄不銹鋼餐具組",
    "s2025": "竪紋方口玻璃碗"
  }
];